{
  "metrics": [
    {
      "name": "active1DayUsers",
      "displayName": "1-day active users",
      "description": "The number of distinct active users on your site or app within a 1 day period. The 1 day period includes the last day in the report's date range. Note: this is the same as Active Users.",
      "visible": true
    },
    {
      "name": "active28DayUsers",
      "displayName": "28-day active users",
      "description": "The number of distinct active users on your site or app within a 28 day period. The 28 day period includes the last day in the report's date range.",
      "visible": true
    },
    {
      "name": "active7DayUsers",
      "displayName": "7-day active users",
      "description": "The number of distinct active users on your site or app within a 7 day period. The 7 day period includes the last day in the report's date range.",
      "visible": true
    },
    {
      "name": "activeUsers",
      "displayName": "Active users",
      "description": "The number of distinct users who visited your site or app.",
      "visible": true
    },
    {
      "name": "adUnitExposure",
      "displayName": "Ad unit exposure",
      "description": "The time that an ad unit was exposed to a user, in milliseconds.",
      "visible": false
    },
    {
      "name": "addToCarts",
      "displayName": "Add to carts",
      "description": "The number of times users added items to their shopping carts.",
      "visible": false
    },
    {
      "name": "advertiserAdClicks",
      "displayName": "Ads clicks",
      "description": "Total number of times users have clicked on an ad to reach the property. Includes clicks from linked integrations like linked Search Ads 360 advertisers. Also includes uploaded clicks from data import.",
      "visible": false
    },
    {
      "name": "advertiserAdCost",
      "displayName": "Ads cost",
      "description": "The total amount you paid for your ads. Includes costs from linked integrations like linked Google Ads accounts. Also includes uploaded cost from data import; to learn more, see Import cost data.",
      "visible": false
    },
    {
      "name": "advertiserAdCostPerClick",
      "displayName": "Ads cost per click",
      "description": "Ads cost per click is ad cost divided by ad clicks and is often abbreviated CPC.",
      "visible": false
    },
    {
      "name": "advertiserAdCostPerKeyEvent",
      "displayName": "Cost per key event",
      "description": "Cost per key event is ad cost divided by key events.",
      "visible": false
    },
    {
      "name": "advertiserAdImpressions",
      "displayName": "Ads impressions",
      "description": "The total number of impressions. Includes impressions from linked integrations like linked Display & Video 360 advertisers. Also includes uploaded impressions from data import.",
      "visible": false
    },
    {
      "name": "averagePurchaseRevenue",
      "displayName": "Average purchase revenue",
      "description": "The average purchase revenue in the transaction group of events.",
      "visible": false
    },
    {
      "name": "averagePurchaseRevenuePerPayingUser",
      "displayName": "ARPPU",
      "description": "Average revenue per paying user (ARPPU) is the total purchase revenue per active user that logged a purchase event. The summary metric is for the time period selected.",
      "visible": false
    },
    {
      "name": "averagePurchaseRevenuePerUser",
      "displayName": "Average purchase revenue per user",
      "description": "The average purchase revenue per active user is the total purchase revenue per active user that logged any event. The summary metric is for the time period selected.",
      "visible": false
    },
    {
      "name": "averageRevenuePerUser",
      "displayName": "ARPU",
      "description": "Average revenue per active user (ARPU). The summary metric is for the time period selected. ARPU uses Total Revenue and includes AdMob estimated earnings.",
      "visible": false
    },
    {
      "name": "averageSessionDuration",
      "displayName": "Average session duration",
      "description": "The average duration (in seconds) of users` sessions.",
      "visible": true
    },
    {
      "name": "bounceRate",
      "displayName": "Bounce rate",
      "description": "The percentage of sessions that were not engaged ((Sessions Minus Engaged sessions) divided by Sessions). This metric is returned as a fraction; for example, 0.2761 means 27.61% of sessions were bounces.",
      "visible": true
    },
    {
      "name": "cartToViewRate",
      "displayName": "Cart-to-view rate",
      "description": "The number of users who added a product(s) to their cart divided by the number of users who viewed the same product(s). This metric is returned as a fraction; for example, 0.1132 means 11.32% of users who viewed a product also added the same product to their cart.",
      "visible": false
    },
    {
      "name": "checkouts",
      "displayName": "Checkouts",
      "description": "The number of times users started the checkout process. This metric counts the occurrence of the begin_checkout event.",
      "visible": false
    },
    {
      "name": "cohortActiveUsers",
      "displayName": "Cohort active users",
      "description": "The number of users in the cohort who are active in the time window corresponding to the cohort nth day/week/month. For example in the row where cohortNthWeek = 0001, this metric is the number of users (in the cohort) who are active in week 1.",
      "visible": false
    },
    {
      "name": "cohortTotalUsers",
      "displayName": "Cohort total users",
      "description": "The total number of users in the cohort. This metric is the same value in every row of the report for each cohort. Because cohorts are defined by a shared acquisition date, cohortTotalUsers is the same as cohortActiveUsers for the cohort's selection date range. For report rows later than the cohort's selection range, it is typical for cohortActiveUsers to be smaller than cohortTotalUsers. This difference represents users from the cohort that were not active for the later date. cohortTotalUsers is commonly used in the metric expression cohortActiveUsers/cohortTotalUsers to compute a user retention fraction for the cohort. The relationship between activeUsers and totalUsers is not equivalent to the relationship between cohortActiveUsers and cohortTotalUsers.",
      "visible": false
    },
    {
      "name": "crashAffectedUsers",
      "displayName": "Crash-affected users",
      "description": "The number of users that logged a crash in this row of the report. For example if the report is time series by date, this metrics reports total users with at least one crash on this date. Crashes are events with the name \"app_exception\".",
      "visible": false
    },
    {
      "name": "crashFreeUsersRate",
      "displayName": "Crash-free users rate",
      "description": "The number of users without crash events (in this row of the report) divided by the total number of users. This metric is returned as a fraction; for example, 0.9243 means 92.43% of users were crash-free.",
      "visible": false
    },
    {
      "name": "dauPerMau",
      "displayName": "DAU / MAU",
      "description": "The rolling percent of 30-day active users who are also 1-day active users. This metric is returned as a fraction; for example, 0.113 means 11.3% of 30-day active users were also 1-day active users.",
      "visible": false
    },
    {
      "name": "dauPerWau",
      "displayName": "DAU / WAU",
      "description": "The rolling percent of 7-day active users who are also 1-day active users. This metric is returned as a fraction; for example, 0.082 means 8.2% of 7-day active users were also 1-day active users.",
      "visible": false
    },
    {
      "name": "ecommercePurchases",
      "displayName": "Ecommerce purchases",
      "description": "The number of times users completed a purchase. This metric counts purchase events; this metric does not count in_app_purchase and subscription events.",
      "visible": false
    },
    {
      "name": "engagedSessions",
      "displayName": "Engaged sessions",
      "description": "The number of sessions that lasted longer than 10 seconds, or had a key event, or had 2 or more screen views.",
      "visible": true
    },
    {
      "name": "engagementRate",
      "displayName": "Engagement rate",
      "description": "The percentage of engaged sessions (Engaged sessions divided by Sessions). This metric is returned as a fraction; for example, 0.7239 means 72.39% of sessions were engaged sessions.",
      "visible": true
    },
    {
      "name": "eventCount",
      "displayName": "Event count",
      "description": "The count of events.",
      "visible": true
    },
    {
      "name": "eventCountPerUser",
      "displayName": "Event count per user",
      "description": "The average number of events per user (Event count divided by Active users).",
      "visible": false
    },
    {
      "name": "eventValue",
      "displayName": "Event value",
      "description": "The sum of the event parameter named value.",
      "visible": true
    },
    {
      "name": "eventsPerSession",
      "displayName": "Events per session",
      "description": "The average number of events per session (Event count divided by Sessions).",
      "visible": true
    },
    {
      "name": "firstTimePurchaserRate",
      "displayName": "First-time purchaser rate",
      "description": "The percentage of active users who made their first purchase. This metric is returned as a fraction; for example, 0.092 means 9.2% of active users were first time purchasers.",
      "visible": false
    },
    {
      "name": "firstTimePurchasers",
      "displayName": "First time purchasers",
      "description": "The number of users that completed their first purchase event.",
      "visible": false
    },
    {
      "name": "firstTimePurchasersPerNewUser",
      "displayName": "First-time purchasers per new user",
      "description": "The average number of first time purchasers per new user.",
      "visible": false
    },
    {
      "name": "grossItemRevenue",
      "displayName": "Gross item revenue",
      "description": "The total revenue from items only. Gross item revenue is the product of its price and quantity. Item revenue excludes tax and shipping values; tax & shipping values are specified at the event and not item level. Gross item revenue does not include refunds.",
      "visible": false
    },
    {
      "name": "grossPurchaseRevenue",
      "displayName": "Gross purchase revenue",
      "description": "The sum of revenue from purchases made in your app or site. Gross purchase revenue sums the revenue for these events: purchase, ecommerce_purchase, in_app_purchase, app_store_subscription_convert, and app_store_subscription_renew. Purchase revenue is specified by the value parameter in tagging.",
      "visible": false
    },
    {
      "name": "itemDiscountAmount",
      "displayName": "Item discount amount",
      "description": "The monetary value of item discounts in eCommerce events. This metric is populated in tagging by the discount item parameter.",
      "visible": false
    },
    {
      "name": "itemListClickEvents",
      "displayName": "Item-list click events",
      "description": "The number of times users clicked an item when it appeared in a list. This metric counts the occurrence of the select_item event.",
      "visible": false
    },
    {
      "name": "itemListClickThroughRate",
      "displayName": "Item list click through rate",
      "description": "The number of users who selected a list(s) divided by the number of users who viewed the same list(s). This metric is returned as a fraction; for example, 0.2145 means 21.45% of users who viewed a list also selected the same list.",
      "visible": false
    },
    {
      "name": "itemListViewEvents",
      "displayName": "Item-list view events",
      "description": "The number of times the item list was viewed. This metric counts the occurrence of the view_item_list event.",
      "visible": false
    },
    {
      "name": "itemPromotionClickThroughRate",
      "displayName": "Item promotion click through rate",
      "description": "The number of users who selected a promotion(s) divided by the number of users who viewed the same promotion(s). This metric is returned as a fraction; for example, 0.1382 means 13.82% of users who viewed a promotion also selected the promotion.",
      "visible": false
    },
    {
      "name": "itemRefundAmount",
      "displayName": "Item refund amount",
      "description": "Item refund amount is the total refunded transaction revenue from items only. Item refund amount is the product of price and quantity for the refund event.",
      "visible": false
    },
    {
      "name": "itemRevenue",
      "displayName": "Item revenue",
      "description": "The total revenue from purchases minus refunded transaction revenue from items only. Item revenue is the product of its price and quantity. Item revenue excludes tax and shipping values; tax & shipping values are specified at the event and not item level.",
      "visible": false
    },
    {
      "name": "itemViewEvents",
      "displayName": "Item view events",
      "description": "The number of times the item details were viewed. The metric counts the occurrence of the view_item event.",
      "visible": false
    },
    {
      "name": "itemsAddedToCart",
      "displayName": "Items added to cart",
      "description": "The number of units added to cart for a single item. This metric counts the quantity of items in add_to_cart events.",
      "visible": false
    },
    {
      "name": "itemsCheckedOut",
      "displayName": "Items checked out",
      "description": "The number of units checked out for a single item. This metric counts the quantity of items in begin_checkout events.",
      "visible": false
    },
    {
      "name": "itemsClickedInList",
      "displayName": "Items clicked in list",
      "description": "The number of units clicked in list for a single item. This metric counts the quantity of items in select_item events.",
      "visible": false
    },
    {
      "name": "itemsClickedInPromotion",
      "displayName": "Items clicked in promotion",
      "description": "The number of units clicked in promotion for a single item. This metric counts the quantity of items in select_promotion events.",
      "visible": false
    },
    {
      "name": "itemsPurchased",
      "displayName": "Items purchased",
      "description": "The number of units for a single item included in purchase events. This metric counts the quantity of items in purchase events.",
      "visible": false
    },
    {
      "name": "itemsViewed",
      "displayName": "Items viewed",
      "description": "The number of units viewed for a single item. This metric counts the quantity of items in view_item events.",
      "visible": false
    },
    {
      "name": "itemsViewedInList",
      "displayName": "Items viewed in list",
      "description": "The number of units viewed in list for a single item. This metric counts the quantity of items in view_item_list events.",
      "visible": false
    },
    {
      "name": "itemsViewedInPromotion",
      "displayName": "Items viewed in promotion",
      "description": "The number of units viewed in promotion for a single item. This metric counts the quantity of items in view_promotion events.",
      "visible": false
    },
    {
      "name": "keyEvents",
      "displayName": "Key events",
      "description": "The count of key events. Marking an event as a key event affects reports from time of creation. It doesn't change historic data. You can mark any event as key in Google Analytics, and some events (such as first_open or purchase) are marked as key events by default.",
      "visible": true
    },
    {
      "name": "newUsers",
      "displayName": "New users",
      "description": "The number of users who interacted with your site or launched your app for the first time (event triggered: first_open or first_visit).",
      "visible": true
    },
    {
      "name": "organicGoogleSearchAveragePosition",
      "displayName": "Organic Google Search average position",
      "description": "The average ranking of your website URLs for the query reported from Search Console. For example, if your site's URL appears at position 3 for one query and position 7 for another query, the average position would be 5 (3+7/2). This metric requires an active Search Console link.",
      "visible": false
    },
    {
      "name": "organicGoogleSearchClickThroughRate",
      "displayName": "Organic Google Search click through rate",
      "description": "The organic Google Search click through rate reported from Search Console. Click through rate is clicks per impression. This metric is returned as a fraction; for example, 0.0588 means about 5.88% of impressions resulted in a click. This metric requires an active Search Console link.",
      "visible": false
    },
    {
      "name": "organicGoogleSearchClicks",
      "displayName": "Organic Google Search clicks",
      "description": "The number of organic Google Search clicks reported from Search Console. This metric requires an active Search Console link.",
      "visible": false
    },
    {
      "name": "organicGoogleSearchImpressions",
      "displayName": "Organic Google Search impressions",
      "description": "The number of organic Google Search impressions reported from Search Console. This metric requires an active Search Console link.",
      "visible": false
    },
    {
      "name": "promotionClicks",
      "displayName": "Promotion clicks",
      "description": "The number of times an item promotion was clicked. This metric counts the occurrence of the select_promotion event.",
      "visible": false
    },
    {
      "name": "promotionViews",
      "displayName": "Promotion views",
      "description": "The number of times an item promotion was viewed. This metric counts the occurrence of the view_promotion event.",
      "visible": false
    },
    {
      "name": "publisherAdClicks",
      "displayName": "Publisher ad clicks",
      "description": "The number of ad_click events.",
      "visible": false
    },
    {
      "name": "publisherAdImpressions",
      "displayName": "Publisher ad impressions",
      "description": "The number of ad_impression events.",
      "visible": false
    },
    {
      "name": "purchaseRevenue",
      "displayName": "Purchase revenue",
      "description": "The sum of revenue from purchases minus refunded transaction revenue made in your app or site. Purchase revenue sums the revenue for these events: purchase, ecommerce_purchase, in_app_purchase, app_store_subscription_convert, and app_store_subscription_renew. Purchase revenue is specified by the value parameter in tagging.",
      "visible": false
    },
    {
      "name": "purchaseToViewRate",
      "displayName": "Purchase-to-view rate",
      "description": "The number of users who purchased a product(s) divided by the number of users who viewed the same product(s). This metric is returned as a fraction; for example, 0.128 means 12.8% of users that viewed a product(s) also purchased the same product(s).",
      "visible": false
    },
    {
      "name": "purchaserRate",
      "displayName": "Purchaser rate",
      "description": "The percentage of active users who made 1 or more purchase transactions. This metric is returned as a fraction; for example, 0.412 means 41.2% of users were purchasers.",
      "visible": false
    },
    {
      "name": "refundAmount",
      "displayName": "Refund amount",
      "description": "The total refunded transaction revenues. Refund amount sums refunded revenue for the refund and app_store_refund events.",
      "visible": false
    },
    {
      "name": "returnOnAdSpend",
      "displayName": "Return on ad spend",
      "description": "Return On Ad Spend (ROAS) is total revenue divided by advertiser ad cost.",
      "visible": false
    },
    {
      "name": "screenPageViews",
      "displayName": "Views",
      "description": "The number of app screens or web pages your users viewed. Repeated views of a single page or screen are counted. (screen_view + page_view events).",
      "visible": true
    },
    {
      "name": "screenPageViewsPerSession",
      "displayName": "Views per session",
      "description": "The number of app screens or web pages your users viewed per session. Repeated views of a single page or screen are counted. (screen_view + page_view events) / sessions.",
      "visible": true
    },
    {
      "name": "screenPageViewsPerUser",
      "displayName": "Views per user",
      "description": "The number of app screens or web pages your users viewed per active user. Repeated views of a single page or screen are counted. (screen_view + page_view events) / active users.",
      "visible": true
    },
    {
      "name": "scrolledUsers",
      "displayName": "Scrolled users",
      "description": "The number of unique users who scrolled down at least 90% of the page.",
      "visible": true
    },
    {
      "name": "sessionKeyEventRate",
      "displayName": "Session key event rate",
      "description": "The percentage of sessions in which any key event was triggered.",
      "visible": true
    },
    {
      "name": "sessions",
      "displayName": "Sessions",
      "description": "The number of sessions that began on your site or app (event triggered: session_start).",
      "visible": true
    },
    {
      "name": "sessionsPerUser",
      "displayName": "Sessions per user",
      "description": "The average number of sessions per user (Sessions divided by Active Users).",
      "visible": true
    },
    {
      "name": "shippingAmount",
      "displayName": "Shipping amount",
      "description": "Shipping amount associated with a transaction. Populated by the shipping event parameter.",
      "visible": false
    },
    {
      "name": "taxAmount",
      "displayName": "Tax amount",
      "description": "Tax amount associated with a transaction. Populated by the tax event parameter.",
      "visible": false
    },
    {
      "name": "totalAdRevenue",
      "displayName": "Total ad revenue",
      "description": "The total advertising revenue from both Admob and third-party sources.",
      "visible": false
    },
    {
      "name": "totalPurchasers",
      "displayName": "Total purchasers",
      "description": "The number of users that logged purchase events for the time period selected.",
      "visible": false
    },
    {
      "name": "totalRevenue",
      "displayName": "Total revenue",
      "description": "The sum of revenue from purchases, subscriptions, and advertising (Purchase revenue plus Subscription revenue plus Ad revenue) minus refunded transaction revenue.",
      "visible": false
    },
    {
      "name": "totalUsers",
      "displayName": "Total users",
      "description": "The number of distinct users who have logged at least one event, regardless of whether the site or app was in use when that event was logged.",
      "visible": true
    },
    {
      "name": "transactions",
      "displayName": "Transactions",
      "description": "The count of transaction events with purchase revenue. Transaction events are in_app_purchase, ecommerce_purchase, purchase, app_store_subscription_renew, app_store_subscription_convert, and refund.",
      "visible": false
    },
    {
      "name": "transactionsPerPurchaser",
      "displayName": "Transactions per purchaser",
      "description": "The average number of transactions per purchaser.",
      "visible": false
    },
    {
      "name": "userEngagementDuration",
      "displayName": "User engagement",
      "description": "The total amount of time (in seconds) your website or app was in the foreground of users` devices.",
      "visible": true
    },
    {
      "name": "userKeyEventRate",
      "displayName": "User key event rate",
      "description": "The percentage of users who triggered any key event.",
      "visible": true
    },
    {
      "name": "wauPerMau",
      "displayName": "WAU / MAU",
      "description": "The rolling percent of 30-day active users who are also 7-day active users. This metric is returned as a fraction; for example, 0.234 means 23.4% of 30-day active users were also 7-day active users.",
      "visible": true
    }
  ],
  "dimensions": [
    {
      "name": "achievementId",
      "displayName": "Achievement ID",
      "description": "The achievement ID in a game for an event. Populated by the event parameter achievement_id.",
      "visible": false
    },
    {
      "name": "adFormat",
      "displayName": "Ad format",
      "description": "Describes the way ads looked and where they were located. Typical formats include Interstitial, Banner, Rewarded, and Native advanced.",
      "visible": false
    },
    {
      "name": "adSourceName",
      "displayName": "Ad source",
      "description": "The source network that served the ad. Typical sources include AdMob Network, Liftoff, Facebook Audience Network, and Mediated house ads.",
      "visible": false
    },
    {
      "name": "adUnitName",
      "displayName": "Ad unit",
      "description": "The name you chose to describe this Ad unit. Ad units are containers you place in your apps to show ads to users.",
      "visible": false
    },
    {
      "name": "appVersion",
      "displayName": "App version",
      "description": "The app's versionName (Android) or short bundle version (iOS).",
      "visible": false
    },
    {
      "name": "audienceId",
      "displayName": "Audience ID",
      "description": "The numeric identifier of an Audience. Users are reported in the audiences to which they belonged during the report's date range. Current user behavior does not affect historical audience membership in reports.",
      "visible": false
    },
    {
      "name": "audienceName",
      "displayName": "Audience name",
      "description": "The given name of an Audience. Users are reported in the audiences to which they belonged during the report's date range. Current user behavior does not affect historical audience membership in reports.",
      "visible": false
    },
    {
      "name": "audienceResourceName",
      "displayName": "Audience resource name",
      "description": "The resource name of this audience. Resource names contain both collection & resource identifiers to uniquely identify a resource; to learn more, see Resource names.",
      "visible": false
    },
    {
      "name": "brandingInterest",
      "displayName": "Interests",
      "description": "Interests demonstrated by users who are higher in the shopping funnel. Users can be counted in multiple interest categories. For example, Shoppers, Lifestyles & Hobbies/Pet Lovers, or Travel/Travel Buffs/Beachbound Travelers.",
      "visible": false
    },
    {
      "name": "browser",
      "displayName": "Browser",
      "description": "The browsers used to view your website.",
      "visible": true
    },
    {
      "name": "campaignId",
      "displayName": "Campaign ID",
      "description": "The identifier of the marketing campaign. Present only for key events. Includes Google Ads Campaigns, Manual Campaigns, & other Campaigns.",
      "visible": false
    },
    {
      "name": "campaignName",
      "displayName": "Campaign",
      "description": "The name of the marketing campaign. Present only for key events. Includes Google Ads Campaigns, Manual Campaigns, & other Campaigns.",
      "visible": false
    },
    {
      "name": "character",
      "displayName": "Character",
      "description": "The player character in a game for an event. Populated by the event parameter character.",
      "visible": false
    },
    {
      "name": "city",
      "displayName": "City",
      "description": "The city from which the user activity originated.",
      "visible": true
    },
    {
      "name": "cityId",
      "displayName": "City ID",
      "description": "The geographic ID of the city from which the user activity originated, derived from their IP address.",
      "visible": false
    },
    {
      "name": "cm360AccountId",
      "displayName": "CM360 account ID",
      "description": "The CM360 Account ID that led to the key event. Identifies the CM360 Account.",
      "visible": false
    },
    {
      "name": "cm360AccountName",
      "displayName": "CM360 account name",
      "description": "The CM360 Account Name that led to the key event. A CM360 account consists of advertisers, sites, campaigns, and user profiles.",
      "visible": false
    },
    {
      "name": "cm360AdvertiserId",
      "displayName": "CM360 advertiser ID",
      "description": "The CM360 Advertiser ID that led to the key event. A CM360 Advertiser contains a group of campaigns, creative assets, and other settings.",
      "visible": false
    },
    {
      "name": "cm360AdvertiserName",
      "displayName": "CM360 advertiser name",
      "description": "The CM360 Advertiser Name that led to the key event. A CM360 Advertiser contains a group of campaigns, creative assets, and other settings.",
      "visible": false
    },
    {
      "name": "cm360CampaignId",
      "displayName": "CM360 campaign ID",
      "description": "The CM360 Campaign ID that led to the key event. A CM360 campaign can be configured to specify when your ads run, what landing pages are used, and other properties.",
      "visible": false
    },
    {
      "name": "cm360CampaignName",
      "displayName": "CM360 campaign name",
      "description": "The CM360 Campaign Name that led to the key event. A CM360 campaign can be configured to specify when your ads run, what landing pages are used, and other properties.",
      "visible": false
    },
    {
      "name": "cm360CreativeFormat",
      "displayName": "CM360 creative format",
      "description": "The CM360 Creative Format that led to the key event. CM360 creative formats are also referred to as creative types.",
      "visible": false
    },
    {
      "name": "cm360CreativeId",
      "displayName": "CM360 creative ID",
      "description": "The CM360 Creative ID that led to the key event. Identifies a CM360 creative.",
      "visible": false
    },
    {
      "name": "cm360CreativeName",
      "displayName": "CM360 creative name",
      "description": "The CM360 Creative Name that led to the key event. The name given to a CM360 creative.",
      "visible": false
    },
    {
      "name": "cm360CreativeType",
      "displayName": "CM360 creative type",
      "description": "The CM360 Creative Type that led to the key event. A category of CM360 creatives like 'Display' or 'Tracking'. To learn more, see manage creatives",
      "visible": false
    },
    {
      "name": "cm360CreativeTypeId",
      "displayName": "CM360 creative type ID",
      "description": "The CM360 Creative Type ID that led to the key event. Identifies a CM360 creative type.",
      "visible": false
    },
    {
      "name": "cm360CreativeVersion",
      "displayName": "CM360 creative version",
      "description": "The CM360 Creative Version that led to the key event. The version number helps you keep track of multiple versions of your creative in your reports. If you upload a new asset to an existing creative, the version number is increased by one.",
      "visible": false
    },
    {
      "name": "cm360Medium",
      "displayName": "CM360 medium",
      "description": "The CM360 Medium that led to the key event. The CM360 medium is also referred to as the placement cost structure.",
      "visible": false
    },
    {
      "name": "cm360PlacementCostStructure",
      "displayName": "CM360 placement cost structure",
      "description": "The CM360 Placement Cost Structure that led to the key event. Placement cost structures regulate how media cost will be calculated. For example 'CPM'.",
      "visible": false
    },
    {
      "name": "cm360PlacementId",
      "displayName": "CM360 placement ID",
      "description": "The CM360 Placement ID that led to the key event. Identifies a CM360 placement. A placement is the part of a website where your ad appears.",
      "visible": false
    },
    {
      "name": "cm360PlacementName",
      "displayName": "CM360 placement name",
      "description": "The CM360 Placement Name that led to the key event. The given name for a CM360 placement. A placement is the part of a website where your ad appears.",
      "visible": false
    },
    {
      "name": "cm360RenderingId",
      "displayName": "CM360 rendering ID",
      "description": "The CM360 Rendering ID that led to the key event. Identifies a CM360 creative.",
      "visible": false
    },
    {
      "name": "cm360SiteId",
      "displayName": "CM360 site ID",
      "description": "The CM360 Site ID that led to the key event. Identifies a CM360 site.",
      "visible": false
    },
    {
      "name": "cm360SiteName",
      "displayName": "CM360 site name",
      "description": "The CM360 Site Name that led to the key event. The CM360 Site name from which the ad space was purchased.",
      "visible": false
    },
    {
      "name": "cm360Source",
      "displayName": "CM360 source",
      "description": "The CM360 Source that led to the key event. The CM360 source is also referred to as the site name.",
      "visible": false
    },
    {
      "name": "cm360SourceMedium",
      "displayName": "CM360 source / medium",
      "description": "The CM360 Source Medium that led to the key event. A combination of the source and medium.",
      "visible": false
    },
    {
      "name": "cohort",
      "displayName": "Cohort",
      "description": "The cohort's name in the request. A cohort is a set of users who started using your website or app in any consecutive group of days. If a cohort name is not specified in the request, cohorts are named by their zero based index such as cohort_0 and cohort_1.",
      "visible": false
    },
    {
      "name": "cohortNthDay",
      "displayName": "Daily cohort",
      "description": "Day offset relative to the firstSessionDate for the users in the cohort. For example, if a cohort is selected with the start and end date of 2020-03-01, then for the date 2020-03-02, cohortNthDay will be 0001.",
      "visible": false
    },
    {
      "name": "cohortNthMonth",
      "displayName": "Monthly cohort",
      "description": "Month offset relative to the firstSessionDate for the users in the cohort. Month boundaries align with calendar month boundaries. For example, if a cohort is selected with the start and end date in March 2020, then for any date in April 2020, cohortNthMonth will be 0001.",
      "visible": false
    },
    {
      "name": "cohortNthWeek",
      "displayName": "Weekly cohort",
      "description": "Week offset relative to the firstSessionDate for the users in the cohort. Weeks start on Sunday and end on Saturday. For example, if a cohort is selected with the start and end date in the range 2020-11-08 to 2020-11-14, then for the dates in the range 2020-11-15 to 2020-11-21, cohortNthWeek will be 0001.",
      "visible": false
    },
    {
      "name": "contentGroup",
      "displayName": "Content group",
      "description": "A category that applies to items of published content. Populated by the event parameter content_group.",
      "visible": false
    },
    {
      "name": "contentId",
      "displayName": "Content ID",
      "description": "The identifier of the selected content. Populated by the event parameter content_id.",
      "visible": false
    },
    {
      "name": "contentType",
      "displayName": "Content type",
      "description": "The category of the selected content. Populated by the event parameter content_type.",
      "visible": false
    },
    {
      "name": "continent",
      "displayName": "Continent",
      "description": "The continent from which the user activity originated. For example, Americas or Asia.",
      "visible": true
    },
    {
      "name": "continentId",
      "displayName": "Continent ID",
      "description": "The geographic ID of the continent from which the user activity originated, derived from their IP address.",
      "visible": false
    },
    {
      "name": "country",
      "displayName": "Country",
      "description": "The country from which the user activity originated.",
      "visible": true
    },
    {
      "name": "countryId",
      "displayName": "Country ID",
      "description": "The geographic ID of the country from which the user activity originated, derived from their IP address. Formatted according to ISO 3166-1 alpha-2 standard.",
      "visible": false
    },
    {
      "name": "currencyCode",
      "displayName": "Currency",
      "description": "The local currency code (based on ISO 4217 standard) of the eCommerce event. For example, USD or GBP. Currency is specified in tagging by the currency parameter. Businesses that transact in more than one currency can specify a local currency code when sending eCommerce events to Analytics, and this dimension shows those currencies. To Learn more, See Currency reference.",
      "visible": false
    },
    {
      "name": "date",
      "displayName": "Date",
      "description": "The date of the event, formatted as YYYYMMDD.",
      "visible": true,
      "dataType": {
        "type": "date",
        "dateFormat": "yyyyMMdd"
      }
    },
    {
      "name": "dateHour",
      "displayName": "Date + hour (YYYYMMDDHH)",
      "description": "The combined values of date and hour formatted as YYYYMMDDHH.",
      "visible": true,
      "dataType": {
        "type": "date",
        "dateFormat": "yyyyMMddHH"
      }
    },
    {
      "name": "dateHourMinute",
      "displayName": "Date hour and minute",
      "description": "The combined values of date, hour, and minute formatted as YYYYMMDDHHMM.",
      "visible": true,
      "dataType": {
        "type": "date",
        "dateFormat": "yyyyMMddHHmm"
      }
    },
    {
      "name": "day",
      "displayName": "Day",
      "description": "The day of the month, a two-digit number from 01 to 31.",
      "visible": true
    },
    {
      "name": "dayOfWeek",
      "displayName": "Day of week",
      "description": "The integer day of the week. It returns values in the range 0 to 6 with Sunday as the first day of the week.",
      "visible": true
    },
    {
      "name": "dayOfWeekName",
      "displayName": "Day of week name",
      "description": "The day of the week in English. This dimension has values such as Sunday or Monday.",
      "visible": true
    },
    {
      "name": "defaultChannelGroup",
      "displayName": "Default channel group",
      "description": "The key event's default channel group is based primarily on source and medium. An enumeration which includes Direct, Organic Search, Paid Social, Organic Social, Email, Affiliates, Referral, Paid Search, Video, and Display.",
      "visible": true
    },
    {
      "name": "deviceCategory",
      "displayName": "Device category",
      "description": "The type of device: Desktop, Tablet, or Mobile.",
      "visible": true
    },
    {
      "name": "deviceModel",
      "displayName": "Device model",
      "description": "The mobile device model (example: iPhone 10,6).",
      "visible": true
    },
    {
      "name": "dv360AdvertiserId",
      "displayName": "DV360 advertiser ID",
      "description": "The DV360 Advertiser ID that led to the key event. Identifies the DV360 advertiser.",
      "visible": false
    },
    {
      "name": "dv360AdvertiserName",
      "displayName": "DV360 advertiser name",
      "description": "The DV360 Advertiser Name that led to the key event. DV360 advertisers represent real-life businesses that run advertising campaigns.",
      "visible": false
    },
    {
      "name": "dv360CampaignId",
      "displayName": "DV360 campaign ID",
      "description": "The DV360 Campaign ID that led to the key event. Identifies the DV360 campaign.",
      "visible": false
    },
    {
      "name": "dv360CampaignName",
      "displayName": "DV360 campaign name",
      "description": "The DV360 Campaign Name that led to the key event. DV360 campaigns group together related insertion orders with a common business goal.",
      "visible": false
    },
    {
      "name": "dv360CreativeFormat",
      "displayName": "DV360 creative format",
      "description": "The DV360 Creative Format that led to the key event. Also referred to as the creative type. For example, expandable, video, or native.",
      "visible": false
    },
    {
      "name": "dv360CreativeId",
      "displayName": "DV360 creative ID",
      "description": "The DV360 Creative ID that led to the key event. Identifies the DV360 creative.",
      "visible": false
    },
    {
      "name": "dv360CreativeName",
      "displayName": "DV360 creative name",
      "description": "The DV360 Creative Name that led to the key event. The name given to a DV360 creative.",
      "visible": false
    },
    {
      "name": "dv360ExchangeId",
      "displayName": "DV360 exchange ID",
      "description": "The DV360 Exchange ID that led to the key event. Identifies the DV360 exchange.",
      "visible": false
    },
    {
      "name": "dv360ExchangeName",
      "displayName": "DV360 exchange name",
      "description": "The DV360 Exchange Name that led to the key event. The DV360 ad exchange involved in the ad click. To learn more, see managing exchanges.",
      "visible": false
    },
    {
      "name": "dv360InsertionOrderId",
      "displayName": "DV360 insertion order ID",
      "description": "The DV360 Insertion Order ID that led to the key event. Identifies the DV360 insertion order.",
      "visible": false
    },
    {
      "name": "dv360InsertionOrderName",
      "displayName": "DV360 insertion order name",
      "description": "The DV360 Insertion Order Name that led to the key event. A DV360 insertion order contains a set of line items that are related to the same advertising campaign.",
      "visible": false
    },
    {
      "name": "dv360LineItemId",
      "displayName": "DV360 line item ID",
      "description": "The DV360 Line Item ID that led to the key event. Identifies the DV360 line item.",
      "visible": false
    },
    {
      "name": "dv360LineItemName",
      "displayName": "DV360 line item name",
      "description": "The DV360 Line Item Name that led to the key event. A DV360 line item bids on impressions and serves creatives to inventory sources.",
      "visible": false
    },
    {
      "name": "dv360Medium",
      "displayName": "DV360 medium",
      "description": "The DV360 Medium that led to the key event. The billable outcome of the insertion order. For example, cpm.",
      "visible": false
    },
    {
      "name": "dv360PartnerId",
      "displayName": "DV360 partner ID",
      "description": "The DV360 Partner ID that led to the key event. Identifies the DV360 partner.",
      "visible": false
    },
    {
      "name": "dv360PartnerName",
      "displayName": "DV360 partner name",
      "description": "The DV360 Partner Name that led to the key event. DV360 partners represent agencies, trading desks, or large individual advertisers.",
      "visible": false
    },
    {
      "name": "dv360Source",
      "displayName": "DV360 source",
      "description": "The DV360 Source that led to the key event. The DV360 site name where your ad was displayed.",
      "visible": false
    },
    {
      "name": "dv360SourceMedium",
      "displayName": "DV360 source / medium",
      "description": "The DV360 Source Medium that led to the key event. A combination of the source and medium.",
      "visible": false
    },
    {
      "name": "eventName",
      "displayName": "Event name",
      "description": "The name of the event.",
      "visible": true
    },
    {
      "name": "fileExtension",
      "displayName": "File extension",
      "description": "The extension of the downloaded file (for example, pdf or txt). Automatically populated if Enhanced Measurement is enabled. Populated by the event parameter file_extension.",
      "visible": true
    },
    {
      "name": "fileName",
      "displayName": "File name",
      "description": "The page path of the downloaded file (for example, /menus/dinner-menu.pdf). Automatically populated if Enhanced Measurement is enabled. Populated by the event parameter file_name.",
      "visible": true
    },
    {
      "name": "firstSessionDate",
      "displayName": "First session date",
      "description": "The date the user's first session occurred, formatted as YYYYMMDD.",
      "visible": true,
      "dataType": {
        "type": "date",
        "dateFormat": "yyyyMMdd"
      }
    },
    {
      "name": "firstUserCampaignId",
      "displayName": "First user campaign ID",
      "description": "Identifier of the marketing campaign that first acquired the user. Includes Google Ads Campaigns, Manual Campaigns, & other Campaigns.",
      "visible": false
    },
    {
      "name": "firstUserCampaignName",
      "displayName": "First user campaign",
      "description": "Name of the marketing campaign that first acquired the user. Includes Google Ads Campaigns, Manual Campaigns, & other Campaigns.",
      "visible": false
    },
    {
      "name": "firstUserCm360AccountId",
      "displayName": "First user CM360 account ID",
      "description": "The CM360 Account ID that originally acquired the user. Identifies the CM360 account.",
      "visible": false
    },
    {
      "name": "firstUserCm360AccountName",
      "displayName": "First user CM360 account name",
      "description": "The CM360 Account Name that originally acquired the user. A CM360 account consists of advertisers, sites, campaigns, and user profiles.",
      "visible": false
    },
    {
      "name": "firstUserCm360AdvertiserId",
      "displayName": "First user CM360 advertiser ID",
      "description": "The CM360 Advertiser ID that originally acquired the user. Identifies the CM360 advertiser.",
      "visible": false
    },
    {
      "name": "firstUserCm360AdvertiserName",
      "displayName": "First user CM360 advertiser name",
      "description": "The CM360 Advertiser Name that originally acquired the user. A CM360 Advertiser contains a group of campaigns, creative assets, and other settings.",
      "visible": false
    },
    {
      "name": "firstUserCm360CampaignId",
      "displayName": "First user CM360 campaign ID",
      "description": "The CM360 Campaign ID that originally acquired the user. Identifies the CM360 campaign.",
      "visible": false
    },
    {
      "name": "firstUserCm360CampaignName",
      "displayName": "First user CM360 campaign name",
      "description": "The CM360 Campaign Name that originally acquired the user. A CM360 campaign can be configured to specify when your ads run, what landing pages are used, and other properties.",
      "visible": false
    },
    {
      "name": "firstUserCm360CreativeFormat",
      "displayName": "First user CM360 creative format",
      "description": "The CM360 Creative Format that originally acquired the user. CM360 creative formats are also referred to as creative types.",
      "visible": false
    },
    {
      "name": "firstUserCm360CreativeId",
      "displayName": "First user CM360 creative ID",
      "description": "The CM360 Creative ID that originally acquired the user. Identifies a CM360 creative.",
      "visible": false
    },
    {
      "name": "firstUserCm360CreativeName",
      "displayName": "First user CM360 creative name",
      "description": "The CM360 Creative Name that originally acquired the user. The name given to a CM360 creative.",
      "visible": false
    },
    {
      "name": "firstUserCm360CreativeType",
      "displayName": "First user CM360 creative type",
      "description": "The CM360 Creative Type that originally acquired the user. A category of CM360 creatives like 'Display' or 'Tracking'. To learn more, see manage creatives",
      "visible": false
    },
    {
      "name": "firstUserCm360CreativeTypeId",
      "displayName": "First user CM360 creative type ID",
      "description": "The CM360 Creative Type ID that originally acquired the user. Identifies a CM360 creative type.",
      "visible": false
    },
    {
      "name": "firstUserCm360CreativeVersion",
      "displayName": "First user CM360 creative version",
      "description": "The CM360 Creative Version that originally acquired the user. The version number helps you keep track of multiple versions of your creative in your reports. If you upload a new asset to an existing creative, the version number is increased by one.",
      "visible": false
    },
    {
      "name": "firstUserCm360Medium",
      "displayName": "First user CM360 medium",
      "description": "The CM360 Medium that originally acquired the user. The CM360 medium is also referred to as the placement cost structure.",
      "visible": false
    },
    {
      "name": "firstUserCm360PlacementCostStructure",
      "displayName": "First user CM360 placement cost structure",
      "description": "The CM360 Placement Cost Structure that originally acquired the user. Placement cost structures regulate how media cost will be calculated. For example 'CPM'.",
      "visible": false
    },
    {
      "name": "firstUserCm360PlacementId",
      "displayName": "First user CM360 placement ID",
      "description": "The CM360 Placement ID that originally acquired the user. Identifies a CM360 placement. A placement is the part of a website where your ad appears.",
      "visible": false
    },
    {
      "name": "firstUserCm360PlacementName",
      "displayName": "First user CM360 placement name",
      "description": "The CM360 Placement Name that originally acquired the user. The given name for a CM360 placement. A placement is the part of a website where your ad appears.",
      "visible": false
    },
    {
      "name": "firstUserCm360RenderingId",
      "displayName": "First user CM360 rendering ID",
      "description": "The CM360 Rendering ID that originally acquired the user. Identifies a CM360 creative.",
      "visible": false
    },
    {
      "name": "firstUserCm360SiteId",
      "displayName": "First user CM360 site ID",
      "description": "The CM360 Site ID that originally acquired the user. Identifies a CM360 site.",
      "visible": false
    },
    {
      "name": "firstUserCm360SiteName",
      "displayName": "First user CM360 site name",
      "description": "The CM360 Site Name that originally acquired the user. The CM360 Site name from which the ad space was purchased.",
      "visible": false
    },
    {
      "name": "firstUserCm360Source",
      "displayName": "First user CM360 source",
      "description": "The CM360 Source that originally acquired the user. The CM360 source is also referred to as the site name.",
      "visible": false
    },
    {
      "name": "firstUserCm360SourceMedium",
      "displayName": "First user CM360 source / medium",
      "description": "The CM360 Source Medium that originally acquired the user. A combination of the source and medium.",
      "visible": false
    },
    {
      "name": "firstUserDefaultChannelGroup",
      "displayName": "First user default channel group",
      "description": "The default channel group that first acquired the user. Default channel group is based primarily on source and medium. An enumeration which includes Direct, Organic Search, Paid Social, Organic Social, Email, Affiliates, Referral, Paid Search, Video, and Display.",
      "visible": false
    },
    {
      "name": "firstUserDv360AdvertiserId",
      "displayName": "First user DV360 advertiser ID",
      "description": "The DV360 Advertiser ID that originally acquired the user. Identifies the DV360 advertiser.",
      "visible": false
    },
    {
      "name": "firstUserDv360AdvertiserName",
      "displayName": "First user DV360 advertiser name",
      "description": "The DV360 Advertiser Name that originally acquired the user. DV360 advertisers represent real-life businesses that run advertising campaigns.",
      "visible": false
    },
    {
      "name": "firstUserDv360CampaignId",
      "displayName": "First user DV360 campaign ID",
      "description": "The DV360 Campaign ID that originally acquired the user. Identifies the DV360 campaign.",
      "visible": false
    },
    {
      "name": "firstUserDv360CampaignName",
      "displayName": "First user DV360 campaign name",
      "description": "The DV360 Campaign Name that originally acquired the user. DV360 campaigns group together related insertion orders with a common business goal.",
      "visible": false
    },
    {
      "name": "firstUserDv360CreativeFormat",
      "displayName": "First user DV360 creative format",
      "description": "The DV360 Creative Format that originally acquired the user. Also referred to as the creative type. For example, expandable, video, or native.",
      "visible": false
    },
    {
      "name": "firstUserDv360CreativeId",
      "displayName": "First user DV360 creative ID",
      "description": "The DV360 Creative ID that originally acquired the user. Identifies the DV360 creative.",
      "visible": false
    },
    {
      "name": "firstUserDv360CreativeName",
      "displayName": "First user DV360 creative name",
      "description": "The DV360 Creative Name that originally acquired the user. The name given to a DV360 creative.",
      "visible": false
    },
    {
      "name": "firstUserDv360ExchangeId",
      "displayName": "First user DV360 exchange ID",
      "description": "The DV360 Exchange ID that originally acquired the user. Identifies the DV360 exchange.",
      "visible": false
    },
    {
      "name": "firstUserDv360ExchangeName",
      "displayName": "First user DV360 exchange name",
      "description": "The DV360 Exchange Name that originally acquired the user. The DV360 ad exchange involved in the ad click. To learn more, see managing exchanges.",
      "visible": false
    },
    {
      "name": "firstUserDv360InsertionOrderId",
      "displayName": "First user DV360 insertion order ID",
      "description": "The DV360 Insertion Order ID that originally acquired the user. Identifies the DV360 insertion order.",
      "visible": false
    },
    {
      "name": "firstUserDv360InsertionOrderName",
      "displayName": "First user DV360 insertion order name",
      "description": "The DV360 Insertion Order Name that originally acquired the user. A DV360 insertion order contains a set of line items that are related to the same advertising campaign.",
      "visible": false
    },
    {
      "name": "firstUserDv360LineItemId",
      "displayName": "First user DV360 line item ID",
      "description": "The DV360 Line Item ID that originally acquired the user. Identifies the DV360 line item.",
      "visible": false
    },
    {
      "name": "firstUserDv360LineItemName",
      "displayName": "First user DV360 line item name",
      "description": "The DV360 Line Item Name that originally acquired the user. A DV360 line item bids on impressions and serves creatives to inventory sources.",
      "visible": false
    },
    {
      "name": "firstUserDv360Medium",
      "displayName": "First user DV360 medium",
      "description": "The DV360 Medium that originally acquired the user. The billable outcome of the insertion order. For example, cpm.",
      "visible": false
    },
    {
      "name": "firstUserDv360PartnerId",
      "displayName": "First user DV360 partner ID",
      "description": "The DV360 Partner ID that originally acquired the user. Identifies the DV360 partner.",
      "visible": false
    },
    {
      "name": "firstUserDv360PartnerName",
      "displayName": "First user DV360 partner name",
      "description": "The DV360 Partner Name that originally acquired the user. DV360 partners represent agencies, trading desks, or large individual advertisers.",
      "visible": false
    },
    {
      "name": "firstUserDv360Source",
      "displayName": "First user DV360 source",
      "description": "The DV360 Source that originally acquired the user. The DV360 site name where your ad was displayed.",
      "visible": false
    },
    {
      "name": "firstUserDv360SourceMedium",
      "displayName": "First user DV360 source / medium",
      "description": "The DV360 Source Medium that originally acquired the user. A combination of the source and medium.",
      "visible": false
    },
    {
      "name": "firstUserGoogleAdsAccountName",
      "displayName": "First user Google Ads account name",
      "description": "The Account name from Google Ads that first acquired the user.",
      "visible": false
    },
    {
      "name": "firstUserGoogleAdsAdGroupId",
      "displayName": "First user Google Ads ad group ID",
      "description": "The Ad Group Id in Google Ads that first acquired the user.",
      "visible": false
    },
    {
      "name": "firstUserGoogleAdsAdGroupName",
      "displayName": "First user Google Ads ad group name",
      "description": "The Ad Group Name in Google Ads that first acquired the user.",
      "visible": false
    },
    {
      "name": "firstUserGoogleAdsAdNetworkType",
      "displayName": "First user Google Ads ad network type",
      "description": "The advertising network that first acquired the user. An enumeration which includes Google search, Search partners, Google Display Network, Youtube Search, Youtube Videos, Cross-network, Social, and (universal campaign).",
      "visible": false
    },
    {
      "name": "firstUserGoogleAdsCampaignId",
      "displayName": "First user Google Ads campaign ID",
      "description": "Identifier of the Google Ads marketing campaign that first acquired the user.",
      "visible": false
    },
    {
      "name": "firstUserGoogleAdsCampaignName",
      "displayName": "First user Google Ads campaign",
      "description": "Name of the Google Ads marketing campaign that first acquired the user.",
      "visible": false
    },
    {
      "name": "firstUserGoogleAdsCampaignType",
      "displayName": "First user Google Ads campaign type",
      "description": "The campaign type of the Google Ads campaign that first acquired the user. Campaign types determine where customers see your ads and the settings and options available to you in Google Ads. Campaign type is an enumeration that includes: Search, Display, Shopping, Video, Demand Gen, App, Smart, Hotel, Local, and Performance Max. To learn more, see Choose the right campaign type.",
      "visible": false
    },
    {
      "name": "firstUserGoogleAdsCreativeId",
      "displayName": "First user Google Ads creative ID",
      "description": "The ID of the Google Ads creative that first acquired the user. Creative IDs identify individual ads.",
      "visible": false
    },
    {
      "name": "firstUserGoogleAdsCustomerId",
      "displayName": "First user Google Ads customer ID",
      "description": "The Customer ID from Google Ads that first acquired the user. Customer IDs in Google Ads uniquely identify Google Ads accounts.",
      "visible": false
    },
    {
      "name": "firstUserGoogleAdsKeyword",
      "displayName": "First user Google Ads keyword text",
      "description": "First user Google Ads keyword text",
      "visible": false
    },
    {
      "name": "firstUserGoogleAdsQuery",
      "displayName": "First user Google Ads query",
      "description": "The search query that first acquired the user.",
      "visible": false
    },
    {
      "name": "firstUserManualAdContent",
      "displayName": "First user manual ad content",
      "description": "The ad content that first acquired the user. Populated by the utm_content parameter.",
      "visible": false
    },
    {
      "name": "firstUserManualCampaignId",
      "displayName": "First user manual campaign ID",
      "description": "The manual Campaign ID that originally acquired the user. Identifies the manual campaign. Populated by utm_id URL parameter.",
      "visible": false
    },
    {
      "name": "firstUserManualCampaignName",
      "displayName": "First user manual campaign name",
      "description": "The manual Campaign Name that originally acquired the user. The name of the manual campaign. Populated by utm_campaign URL parameter. To learn more, see Collect campaign data with custom URLs.",
      "visible": false
    },
    {
      "name": "firstUserManualCreativeFormat",
      "displayName": "First user manual creative format",
      "description": "The manual Creative Format that originally acquired the user. Identifies the creative format used in the ad. Populated by utm_creative_format URL parameter.",
      "visible": false
    },
    {
      "name": "firstUserManualMarketingTactic",
      "displayName": "First user manual marketing tactic",
      "description": "The manual Marketing Tactic that originally acquired the user. The targeting criteria applied to a campaign. For example, remarketing or prospecting. Populated by utm_marketing_tactic URL parameter.",
      "visible": false
    },
    {
      "name": "firstUserManualMedium",
      "displayName": "First user manual medium",
      "description": "The manual Medium that originally acquired the user. The marketing medium used in the referral. For example, cpc. Populated by utm_medium URL parameter.",
      "visible": false
    },
    {
      "name": "firstUserManualSource",
      "displayName": "First user manual source",
      "description": "The manual Source that originally acquired the user. The referrer. Populated by utm_source URL parameter.",
      "visible": false
    },
    {
      "name": "firstUserManualSourceMedium",
      "displayName": "First user manual source / medium",
      "description": "The manual Source Medium that originally acquired the user. A combination of the source and medium.",
      "visible": false
    },
    {
      "name": "firstUserManualSourcePlatform",
      "displayName": "First user manual source platform",
      "description": "The manual Source Platform that originally acquired the user. The platform responsible for directing traffic to a given Analytics property. Populated by utm_source_platform URL parameter.",
      "visible": false
    },
    {
      "name": "firstUserManualTerm",
      "displayName": "First user manual term",
      "description": "The term that first acquired the user. Populated by the utm_term parameter.",
      "visible": false
    },
    {
      "name": "firstUserMedium",
      "displayName": "First user medium",
      "description": "The medium that first acquired the user to your website or app.",
      "visible": false
    },
    {
      "name": "firstUserPrimaryChannelGroup",
      "displayName": "First user primary channel group",
      "description": "The primary channel group that originally acquired a user. Primary channel groups are the channel groups used in standard reports in Google Analytics and serve as an active record of your property's data in alignment with channel grouping over time. To learn more, see Custom channel groups.",
      "visible": false
    },
    {
      "name": "firstUserSa360AdGroupId",
      "displayName": "First user SA360 ad group ID",
      "description": "The SA360 Ad Group ID that originally acquired the user. Identifies the SA360 ad group.",
      "visible": false
    },
    {
      "name": "firstUserSa360AdGroupName",
      "displayName": "First user SA360 ad group name",
      "description": "The SA360 Ad Group Name that originally acquired the user. SA360 Ad groups contain ads and keywords that relate to each other.",
      "visible": false
    },
    {
      "name": "firstUserSa360CampaignId",
      "displayName": "First user SA360 campaign ID",
      "description": "The SA360 Campaign ID that originally acquired the user. Identifies the SA360 campaign.",
      "visible": false
    },
    {
      "name": "firstUserSa360CampaignName",
      "displayName": "First user SA360 campaign",
      "description": "The SA360 Campaign Name that originally acquired the user. A SA360 campaign lets you organize your ads and define a goal for your advertising.",
      "visible": false
    },
    {
      "name": "firstUserSa360CreativeFormat",
      "displayName": "First user SA360 creative format",
      "description": "The SA360 Creative Format that originally acquired the user. The creative format is the specific layout or design of the advertisement used in a campaign.",
      "visible": false
    },
    {
      "name": "firstUserSa360EngineAccountId",
      "displayName": "First user SA360 engine account ID",
      "description": "The SA360 Engine Account ID that originally acquired the user. Identifies the SA360 engine account.",
      "visible": false
    },
    {
      "name": "firstUserSa360EngineAccountName",
      "displayName": "First user SA360 engine account name",
      "description": "The SA360 Engine Account Name that originally acquired the user. A SA360 engine account contains campaigns, ad groups, and other items from an advertising account. To learn more, see SA360 engine account.",
      "visible": false
    },
    {
      "name": "firstUserSa360EngineAccountType",
      "displayName": "First user SA360 engine account type",
      "description": "The SA360 Engine Account Type that originally acquired the user. The type of engine used by the search engine account.",
      "visible": false
    },
    {
      "name": "firstUserSa360KeywordText",
      "displayName": "First user SA360 keyword text",
      "description": "The SA360 Keyword Text that originally acquired the user. The keywords that matched the search query.",
      "visible": false
    },
    {
      "name": "firstUserSa360ManagerAccountId",
      "displayName": "First user SA360 manager account ID",
      "description": "The SA360 Manager Account ID that originally acquired the user. Identifies the SA360 manager account.",
      "visible": false
    },
    {
      "name": "firstUserSa360ManagerAccountName",
      "displayName": "First user SA360 manager account name",
      "description": "The SA360 Manager Account Name that originally acquired the user. The top level of the Search Ads 360 account hierarchy and is used for administration and reporting across the lower-level sub-manager and client accounts.",
      "visible": false
    },
    {
      "name": "firstUserSa360Medium",
      "displayName": "First user SA360 medium",
      "description": "The SA360 Medium that originally acquired the user. The payment mode used in ad buying. For example, cpc.",
      "visible": false
    },
    {
      "name": "firstUserSa360Query",
      "displayName": "First user SA360 query",
      "description": "The SA360 Query that originally acquired the user. The search query typed by the user.",
      "visible": false
    },
    {
      "name": "firstUserSa360Source",
      "displayName": "First user SA360 source",
      "description": "The SA360 Source that originally acquired the user. The search query happened on this site.",
      "visible": false
    },
    {
      "name": "firstUserSa360SourceMedium",
      "displayName": "First user SA360 source / medium",
      "description": "The SA360 Source Medium that originally acquired the user. A combination of the source and medium.",
      "visible": false
    },
    {
      "name": "firstUserSource",
      "displayName": "First user source",
      "description": "The source that first acquired the user to your website or app.",
      "visible": true
    },
    {
      "name": "firstUserSourceMedium",
      "displayName": "First user source / medium",
      "description": "The combined values of the dimensions firstUserSource and firstUserMedium.",
      "visible": true
    },
    {
      "name": "firstUserSourcePlatform",
      "displayName": "First user source platform",
      "description": "The source platform that first acquired the user. Don't depend on this field returning Manual for traffic that uses UTMs; this field will update from returning Manual to returning (not set) for an upcoming feature launch.",
      "visible": true
    },
    {
      "name": "fullPageUrl",
      "displayName": "Full page URL",
      "description": "The hostname, page path, and query string for web pages visited; for example, the fullPageUrl portion of https://www.example.com/store/contact-us?query_string=true is www.example.com/store/contact-us?query_string=true.",
      "visible": true
    },
    {
      "name": "googleAdsAccountName",
      "displayName": "Google Ads account name",
      "description": "The Account name from Google Ads for the campaign that led to the key event. Corresponds to customer.descriptive_name in the Google Ads API.",
      "visible": false
    },
    {
      "name": "googleAdsAdGroupId",
      "displayName": "Google Ads ad group ID",
      "description": "The Google Ads ad group ID attributed to the key event.",
      "visible": false
    },
    {
      "name": "googleAdsAdGroupName",
      "displayName": "Google Ads ad group name",
      "description": "The ad group name attributed to the key event.",
      "visible": false
    },
    {
      "name": "googleAdsAdNetworkType",
      "displayName": "Google Ads ad network type",
      "description": "The advertising network type of the key event. An enumeration which includes Google search, Search partners, Google Display Network, Youtube Search, Youtube Videos, Cross-network, Social, and (universal campaign).",
      "visible": false
    },
    {
      "name": "googleAdsCampaignId",
      "displayName": "Google Ads campaign ID",
      "description": "The campaign ID for the Google Ads campaign attributed to the key event.",
      "visible": false
    },
    {
      "name": "googleAdsCampaignName",
      "displayName": "Google Ads campaign",
      "description": "The campaign name for the Google Ads campaign attributed to the key event.",
      "visible": false
    },
    {
      "name": "googleAdsCampaignType",
      "displayName": "Google Ads campaign type",
      "description": "The campaign type for the Google Ads campaign attributed to the key event. Campaign types determine where customers see your ads and the settings and options available to you in Google Ads. Campaign type is an enumeration that includes: Search, Display, Shopping, Video, Demand Gen, App, Smart, Hotel, Local, and Performance Max. To learn more, see Choose the right campaign type.",
      "visible": false
    },
    {
      "name": "googleAdsCreativeId",
      "displayName": "Google Ads creative ID",
      "description": "The ID of the Google Ads creative attributed to the key event. Creative IDs identify individual ads.",
      "visible": false
    },
    {
      "name": "googleAdsCustomerId",
      "displayName": "Google Ads customer ID",
      "description": "The Customer ID from Google Ads for the campaign that led to key event. Customer IDs in Google Ads uniquely identify Google Ads accounts.",
      "visible": false
    },
    {
      "name": "googleAdsKeyword",
      "displayName": "Google Ads keyword text",
      "description": "The matched keyword that led to the key event. Keywords are words or phrases describing your product or service that you choose to get your ad in front of the right customers. To learn more about Keywords, see Keywords: Definition.",
      "visible": false
    },
    {
      "name": "googleAdsQuery",
      "displayName": "Google Ads query",
      "description": "The search query that led to the key event.",
      "visible": false
    },
    {
      "name": "groupId",
      "displayName": "Group ID",
      "description": "The player group ID in a game for an event. Populated by the event parameter group_id.",
      "visible": false
    },
    {
      "name": "hostName",
      "displayName": "Hostname",
      "description": "Includes the subdomain and domain names of a URL; for example, the Host Name of www.example.com/contact.html is www.example.com.",
      "visible": false
    },
    {
      "name": "hour",
      "displayName": "Hour",
      "description": "The two-digit hour of the day that the event was logged. This dimension ranges from 0-23 and is reported in your property's timezone.",
      "visible": true
    },
    {
      "name": "isKeyEvent",
      "displayName": "Is key event",
      "description": "The string true if the event is a key event. Marking an event as a key event affects reports from time of creation. It doesn't change historic data. You can mark any event as key in Google Analytics, and some events (such as first_open or purchase) are marked as key events by default.",
      "visible": true
    },
    {
      "name": "isoWeek",
      "displayName": "ISO week of the year",
      "description": "ISO week number, where each week starts on Monday. For details, see http://en.wikipedia.org/wiki/ISO_week_date. Example values include 01, 02, & 53.",
      "visible": true
    },
    {
      "name": "isoYear",
      "displayName": "ISO year",
      "description": "The ISO year of the event. For details, see http://en.wikipedia.org/wiki/ISO_week_date. Example values include 2022 & 2023.",
      "visible": true
    },
    {
      "name": "isoYearIsoWeek",
      "displayName": "ISO week of ISO year",
      "description": "The combined values of isoWeek and isoYear. Example values include 201652 & 201701.",
      "visible": true
    },
    {
      "name": "itemAffiliation",
      "displayName": "Item affiliation",
      "description": "The name or code of the affiliate (partner/vendor; if any) associated with an individual item. Populated by the affiliation item parameter.",
      "visible": false
    },
    {
      "name": "itemBrand",
      "displayName": "Item brand",
      "description": "Brand name of the item.",
      "visible": false
    },
    {
      "name": "itemCategory",
      "displayName": "Item category",
      "description": "The hierarchical category in which the item is classified. For example, in Apparel/Mens/Summer/Shirts/T-shirts, Apparel is the item category.",
      "visible": false
    },
    {
      "name": "itemCategory2",
      "displayName": "Item category 2",
      "description": "The hierarchical category in which the item is classified. For example, in Apparel/Mens/Summer/Shirts/T-shirts, Mens is the item category 2.",
      "visible": false
    },
    {
      "name": "itemCategory3",
      "displayName": "Item category 3",
      "description": "The hierarchical category in which the item is classified. For example, in Apparel/Mens/Summer/Shirts/T-shirts, Summer is the item category 3.",
      "visible": false
    },
    {
      "name": "itemCategory4",
      "displayName": "Item category 4",
      "description": "The hierarchical category in which the item is classified. For example, in Apparel/Mens/Summer/Shirts/T-shirts, Shirts is the item category 4.",
      "visible": false
    },
    {
      "name": "itemCategory5",
      "displayName": "Item category 5",
      "description": "The hierarchical category in which the item is classified. For example, in Apparel/Mens/Summer/Shirts/T-shirts, T-shirts is the item category 5.",
      "visible": false
    },
    {
      "name": "itemId",
      "displayName": "Item ID",
      "description": "The ID of the item.",
      "visible": false
    },
    {
      "name": "itemListId",
      "displayName": "Item list ID",
      "description": "The ID of the item list.",
      "visible": false
    },
    {
      "name": "itemListName",
      "displayName": "Item list name",
      "description": "The name of the item list.",
      "visible": false
    },
    {
      "name": "itemListPosition",
      "displayName": "Item list position",
      "description": "The position of an item in a list. For example, a product you sell in a list. This dimension is populated in tagging by the index parameter in the items array.",
      "visible": false
    },
    {
      "name": "itemLocationID",
      "displayName": "Item location ID",
      "description": "The physical location associated with the item. For example, the physical store location. It's recommended to use the Google Place ID that corresponds to the associated item. A custom location ID can also be used. This field is populated in tagging by the location_id parameter in the items array.",
      "visible": false
    },
    {
      "name": "itemName",
      "displayName": "Item name",
      "description": "The name of the item.",
      "visible": false
    },
    {
      "name": "itemPromotionCreativeName",
      "displayName": "Item promotion creative name",
      "description": "The name of the item-promotion creative.",
      "visible": false
    },
    {
      "name": "itemPromotionCreativeSlot",
      "displayName": "Item promotion creative slot",
      "description": "The name of the promotional creative slot associated with the item. This dimension can be specified in tagging by the creative_slot parameter at the event or item level. If the parameter is specified at both the event & item level, the item-level parameter is used.",
      "visible": false
    },
    {
      "name": "itemPromotionId",
      "displayName": "Item promotion ID",
      "description": "The ID of the item promotion.",
      "visible": false
    },
    {
      "name": "itemPromotionName",
      "displayName": "Item promotion name",
      "description": "The name of the promotion for the item.",
      "visible": false
    },
    {
      "name": "itemVariant",
      "displayName": "Item variant",
      "description": "The specific variation of a product. For example, XS, S, M, or L for size; or Red, Blue, Green, or Black for color. Populated by the item_variant parameter.",
      "visible": false
    },
    {
      "name": "landingPage",
      "displayName": "Landing page",
      "description": "The page path associated with the first pageview in a session.",
      "visible": true
    },
    {
      "name": "landingPagePlusQueryString",
      "displayName": "Landing page + query string",
      "description": "The page path + query string associated with the first pageview in a session.",
      "visible": true
    },
    {
      "name": "language",
      "displayName": "Language",
      "description": "The language setting of the user's browser or device. For example, English.",
      "visible": true
    },
    {
      "name": "languageCode",
      "displayName": "Language code",
      "description": "The language setting (ISO 639) of the user's browser or device. For example, en-us.",
      "visible": true
    },
    {
      "name": "level",
      "displayName": "Level",
      "description": "The player's level in a game. Populated by the event parameter level.",
      "visible": false
    },
    {
      "name": "linkClasses",
      "displayName": "Link classes",
      "description": "The HTML class attribute for an outbound link. For example if a user clicks a link <a class=\"center\" href=\"www.youtube.com\">, this dimension will return center. Automatically populated if Enhanced Measurement is enabled. Populated by the event parameter link_classes.",
      "visible": true
    },
    {
      "name": "linkDomain",
      "displayName": "Link domain",
      "description": "The destination domain of the outbound link. For example if a user clicks a link <a href=\"www.youtube.com\">, this dimension will return youtube.com. Automatically populated if Enhanced Measurement is enabled. Populated by the event parameter link_domain.",
      "visible": true
    },
    {
      "name": "linkId",
      "displayName": "Link ID",
      "description": "The HTML ID attribute for an outbound link or file download. For example if a user clicks a link <a id=\"socialLinks\" href=\"www.youtube.com\">, this dimension will return socialLinks. Automatically populated if Enhanced Measurement is enabled. Populated by the event parameter link_id.",
      "visible": false
    },
    {
      "name": "linkText",
      "displayName": "Link text",
      "description": "The link text of the file download. Automatically populated if Enhanced Measurement is enabled. Populated by the event parameter link_text.",
      "visible": true
    },
    {
      "name": "linkUrl",
      "displayName": "Link URL",
      "description": "The full URL for an outbound link or file download. For example if a user clicks a link <a href=\"https://www.youtube.com/results?search_query=analytics\">, this dimension will return https://www.youtube.com/results?search_query=analytics. Automatically populated if Enhanced Measurement is enabled. Populated by the event parameter link_url.",
      "visible": true
    },
    {
      "name": "manualAdContent",
      "displayName": "Manual ad content",
      "description": "The ad content attributed to the key event. Populated by the utm_content parameter.",
      "visible": false
    },
    {
      "name": "manualCampaignId",
      "displayName": "Manual campaign ID",
      "description": "The manual Campaign ID that led to the key event. Identifies the manual campaign. Populated by utm_id URL parameter.",
      "visible": false
    },
    {
      "name": "manualCampaignName",
      "displayName": "Manual campaign name",
      "description": "The manual Campaign Name that led to the key event. The name of the manual campaign. Populated by utm_campaign URL parameter. To learn more, see Collect campaign data with custom URLs.",
      "visible": false
    },
    {
      "name": "manualCreativeFormat",
      "displayName": "Manual creative format",
      "description": "The manual Creative Format that led to the key event. Identifies the creative format used in the ad. Populated by utm_creative_format URL parameter.",
      "visible": false
    },
    {
      "name": "manualMarketingTactic",
      "displayName": "Manual marketing tactic",
      "description": "The manual Marketing Tactic that led to the key event. The targeting criteria applied to a campaign. For example, remarketing or prospecting. Populated by utm_marketing_tactic URL parameter.",
      "visible": false
    },
    {
      "name": "manualMedium",
      "displayName": "Manual medium",
      "description": "The manual Medium that led to the key event. The marketing medium used in the referral. For example, cpc. Populated by utm_medium URL parameter.",
      "visible": false
    },
    {
      "name": "manualSource",
      "displayName": "Manual source",
      "description": "The manual Source that led to the key event. The referrer. Populated by utm_source URL parameter.",
      "visible": false
    },
    {
      "name": "manualSourceMedium",
      "displayName": "Manual source / medium",
      "description": "The manual Source Medium that led to the key event. A combination of the source and medium.",
      "visible": true
    },
    {
      "name": "manualSourcePlatform",
      "displayName": "Manual source platform",
      "description": "The manual Source Platform that led to the key event. The platform responsible for directing traffic to a given Analytics property. Populated by utm_source_platform URL parameter.",
      "visible": false
    },
    {
      "name": "manualTerm",
      "displayName": "Manual term",
      "description": "The term attributed to the key event. Populated by the utm_term parameter.",
      "visible": true
    },
    {
      "name": "medium",
      "displayName": "Medium",
      "description": "The medium attributed to the key event.",
      "visible": true
    },
    {
      "name": "method",
      "displayName": "Method",
      "description": "The method by which an event was triggered. Populated by the event parameter method.",
      "visible": true
    },
    {
      "name": "minute",
      "displayName": "Minute",
      "description": "The two-digit minute of the hour that the event was logged. This dimension ranges from 0-59 and is reported in your property's timezone.",
      "visible": true
    },
    {
      "name": "mobileDeviceBranding",
      "displayName": "Device brand",
      "description": "Manufacturer or branded name (examples: Samsung, HTC, Verizon, T-Mobile).",
      "visible": true
    },
    {
      "name": "mobileDeviceMarketingName",
      "displayName": "Device",
      "description": "The branded device name (examples: Galaxy S10 or P30 Pro).",
      "visible": true
    },
    {
      "name": "mobileDeviceModel",
      "displayName": "Mobile model",
      "description": "The mobile device model name (examples: iPhone X or SM-G950F).",
      "visible": true
    },
    {
      "name": "month",
      "displayName": "Month",
      "description": "The month of the event, a two digit integer from 01 to 12.",
      "visible": true
    },
    {
      "name": "newVsReturning",
      "displayName": "New / returning",
      "description": "New users have 0 previous sessions, and returning users have 1 or more previous sessions. This dimension returns two values: new or returning.",
      "visible": true
    },
    {
      "name": "nthDay",
      "displayName": "Nth day",
      "description": "The number of days since the start of the date range.",
      "visible": true
    },
    {
      "name": "nthHour",
      "displayName": "Nth hour",
      "description": "The number of hours since the start of the date range. The starting hour is 0000.",
      "visible": true
    },
    {
      "name": "nthMinute",
      "displayName": "Nth minute",
      "description": "The number of minutes since the start of the date range. The starting minute is 0000.",
      "visible": true
    },
    {
      "name": "nthMonth",
      "displayName": "Nth month",
      "description": "The number of months since the start of a date range. The starting month is 0000.",
      "visible": true
    },
    {
      "name": "nthWeek",
      "displayName": "Nth week",
      "description": "A number representing the number of weeks since the start of a date range.",
      "visible": true
    },
    {
      "name": "nthYear",
      "displayName": "Nth year",
      "description": "The number of years since the start of the date range. The starting year is 0000.",
      "visible": true
    },
    {
      "name": "operatingSystem",
      "displayName": "Operating system",
      "description": "The operating systems used by visitors to your app or website. Includes desktop and mobile operating systems such as Windows and Android.",
      "visible": true
    },
    {
      "name": "operatingSystemVersion",
      "displayName": "OS version",
      "description": "The operating system versions used by visitors to your website or app. For example, Android 10's version is 10, and iOS 13.5.1's version is 13.5.1.",
      "visible": true
    },
    {
      "name": "operatingSystemWithVersion",
      "displayName": "Operating system with version",
      "description": "The operating system and version. For example, Android 10 or Windows 7.",
      "visible": true
    },
    {
      "name": "orderCoupon",
      "displayName": "Order coupon",
      "description": "Code for the order-level coupon.",
      "visible": false
    },
    {
      "name": "outbound",
      "displayName": "Outbound",
      "description": "Returns true if the link led to a site that is not a part of the property's domain. Automatically populated if Enhanced Measurement is enabled. Populated by the event parameter outbound.",
      "visible": true
    },
    {
      "name": "pageLocation",
      "displayName": "Page location",
      "description": "The protocol, hostname, page path, and query string for web pages visited; for example, the pageLocation portion of https://www.example.com/store/contact-us?query_string=true is https://www.example.com/store/contact-us?query_string=true. Populated by the event parameter page_location.",
      "visible": true
    },
    {
      "name": "pagePath",
      "displayName": "Page path",
      "description": "The portion of the URL between the hostname and query string for web pages visited; for example, the pagePath portion of https://www.example.com/store/contact-us?query_string=true is /store/contact-us.",
      "visible": true
    },
    {
      "name": "pagePathPlusQueryString",
      "displayName": "Page path + query string",
      "description": "The portion of the URL following the hostname for web pages visited; for example, the pagePathPlusQueryString portion of https://www.example.com/store/contact-us?query_string=true is /store/contact-us?query_string=true.",
      "visible": true
    },
    {
      "name": "pageReferrer",
      "displayName": "Page referrer",
      "description": "The full referring URL including the hostname and path. This referring URL is the user's previous URL and can be this website's domain or other domains. Populated by the event parameter page_referrer.",
      "visible": true
    },
    {
      "name": "pageTitle",
      "displayName": "Page title",
      "description": "The web page titles used on your site.",
      "visible": true
    },
    {
      "name": "percentScrolled",
      "displayName": "Percent scrolled",
      "description": "The percentage down the page that the user has scrolled (for example, 90). Automatically populated if Enhanced Measurement is enabled. Populated by the event parameter percent_scrolled.",
      "visible": true
    },
    {
      "name": "platform",
      "displayName": "Platform",
      "description": "The platform on which your app or website ran; for example, web, iOS, or Android. To determine a stream's type in a report, use both platform and streamId.",
      "visible": false
    },
    {
      "name": "platformDeviceCategory",
      "displayName": "Platform / device category",
      "description": "The platform and type of device on which your website or mobile app ran. (example: Android / mobile)",
      "visible": true
    },
    {
      "name": "primaryChannelGroup",
      "displayName": "Primary channel group",
      "description": "The primary channel group attributed to the key event. Primary channel groups are the channel groups used in standard reports in Google Analytics and serve as an active record of your property's data in alignment with channel grouping over time. To learn more, see Custom channel groups.",
      "visible": true
    },
    {
      "name": "region",
      "displayName": "Region",
      "description": "The geographic region from which the user activity originated, derived from their IP address.",
      "visible": true
    },
    {
      "name": "sa360AdGroupId",
      "displayName": "SA360 ad group ID",
      "description": "The SA360 Ad Group ID that led to the key event. Identifies the SA360 ad group.",
      "visible": false
    },
    {
      "name": "sa360AdGroupName",
      "displayName": "SA360 ad group name",
      "description": "The SA360 Ad Group Name that led to the key event. SA360 Ad groups contain ads and keywords that relate to each other.",
      "visible": false
    },
    {
      "name": "sa360CampaignId",
      "displayName": "SA360 campaign ID",
      "description": "The SA360 Campaign ID that led to the key event. Identifies the SA360 campaign.",
      "visible": false
    },
    {
      "name": "sa360CampaignName",
      "displayName": "SA360 campaign",
      "description": "The SA360 Campaign Name that led to the key event. A SA360 campaign lets you organize your ads and define a goal for your advertising.",
      "visible": false
    },
    {
      "name": "sa360CreativeFormat",
      "displayName": "SA360 creative format",
      "description": "The SA360 Creative Format that led to the key event. The creative format is the specific layout or design of the advertisement used in a campaign.",
      "visible": false
    },
    {
      "name": "sa360EngineAccountId",
      "displayName": "SA360 engine account ID",
      "description": "The SA360 Engine Account ID that led to the key event. Identifies the SA360 engine account.",
      "visible": false
    },
    {
      "name": "sa360EngineAccountName",
      "displayName": "SA360 engine account name",
      "description": "The SA360 Engine Account Name that led to the key event. A SA360 engine account contains campaigns, ad groups, and other items from an advertising account. To learn more, see SA360 engine account.",
      "visible": false
    },
    {
      "name": "sa360EngineAccountType",
      "displayName": "SA360 engine account type",
      "description": "The SA360 Engine Account Type that led to the key event. The type of engine used by the search engine account.",
      "visible": false
    },
    {
      "name": "sa360KeywordText",
      "displayName": "SA360 keyword text",
      "description": "The SA360 Keyword Text that led to the key event. The keywords that matched the search query.",
      "visible": false
    },
    {
      "name": "sa360ManagerAccountId",
      "displayName": "SA360 manager account ID",
      "description": "The SA360 Manager Account ID that led to the key event. Identifies the SA360 manager account.",
      "visible": false
    },
    {
      "name": "sa360ManagerAccountName",
      "displayName": "SA360 manager account name",
      "description": "The SA360 Manager Account Name that led to the key event. The top level of the Search Ads 360 account hierarchy and is used for administration and reporting across the lower-level sub-manager and client accounts.",
      "visible": false
    },
    {
      "name": "sa360Medium",
      "displayName": "SA360 medium",
      "description": "The SA360 Medium that led to the key event. The payment mode used in ad buying. For example, cpc.",
      "visible": false
    },
    {
      "name": "sa360Query",
      "displayName": "SA360 query",
      "description": "The SA360 Query that led to the key event. The search query typed by the user.",
      "visible": false
    },
    {
      "name": "sa360Source",
      "displayName": "SA360 source",
      "description": "The SA360 Source that led to the key event. The search query happened on this site.",
      "visible": false
    },
    {
      "name": "sa360SourceMedium",
      "displayName": "SA360 source / medium",
      "description": "The SA360 Source Medium that led to the key event. A combination of the source and medium.",
      "visible": false
    },
    {
      "name": "screenResolution",
      "displayName": "Screen resolution",
      "description": "The screen resolution of the user's monitor. For example, 1920x1080.",
      "visible": true
    },
    {
      "name": "searchTerm",
      "displayName": "Search term",
      "description": "The term searched by the user. For example if the user visits /some-page.html?q=some-term, this dimension returns some-term. Automatically populated if Enhanced Measurement is enabled. Populated by the event parameter search_term.",
      "visible": true
    },
    {
      "name": "sessionCampaignId",
      "displayName": "Session campaign ID",
      "description": "The marketing campaign ID for a session. Includes Google Ads Campaigns, Manual Campaigns, & other Campaigns.",
      "visible": false
    },
    {
      "name": "sessionCampaignName",
      "displayName": "Session campaign",
      "description": "The marketing campaign name for a session. Includes Google Ads Campaigns, Manual Campaigns, & other Campaigns.",
      "visible": false
    },
    {
      "name": "sessionCm360AccountId",
      "displayName": "Session CM360 account ID",
      "description": "The CM360 Account ID that led to the session. Identifies the CM360 account.",
      "visible": false
    },
    {
      "name": "sessionCm360AccountName",
      "displayName": "Session CM360 account name",
      "description": "The CM360 Account Name that led to the session. A CM360 account consists of advertisers, sites, campaigns, and user profiles.",
      "visible": false
    },
    {
      "name": "sessionCm360AdvertiserId",
      "displayName": "Session CM360 advertiser ID",
      "description": "The CM360 Advertiser ID that led to the session. Identifies the CM360 advertiser.",
      "visible": false
    },
    {
      "name": "sessionCm360AdvertiserName",
      "displayName": "Session CM360 advertiser name",
      "description": "The CM360 Advertiser Name that led to the session. A CM360 Advertiser contains a group of campaigns, creative assets, and other settings.",
      "visible": false
    },
    {
      "name": "sessionCm360CampaignId",
      "displayName": "Session CM360 campaign ID",
      "description": "The CM360 Campaign ID that led to the session. Identifies the CM360 campaign.",
      "visible": false
    },
    {
      "name": "sessionCm360CampaignName",
      "displayName": "Session CM360 campaign name",
      "description": "The CM360 Campaign Name that led to the session. A CM360 campaign can be configured to specify when your ads run, what landing pages are used, and other properties.",
      "visible": false
    },
    {
      "name": "sessionCm360CreativeFormat",
      "displayName": "Session CM360 creative format",
      "description": "The CM360 Creative Format that led to the session. CM360 creative formats are also referred to as creative types.",
      "visible": false
    },
    {
      "name": "sessionCm360CreativeId",
      "displayName": "Session CM360 creative ID",
      "description": "The CM360 Creative ID that led to the session. Identifies a CM360 creative.",
      "visible": false
    },
    {
      "name": "sessionCm360CreativeName",
      "displayName": "Session CM360 creative name",
      "description": "The CM360 Creative Name that led to the session. The name given to a CM360 creative.",
      "visible": false
    },
    {
      "name": "sessionCm360CreativeType",
      "displayName": "Session CM360 creative type",
      "description": "The CM360 Creative Type that led to the session. A category of CM360 creatives like 'Display' or 'Tracking'. To learn more, see manage creatives",
      "visible": false
    },
    {
      "name": "sessionCm360CreativeTypeId",
      "displayName": "Session CM360 creative type ID",
      "description": "The CM360 Creative Type ID that led to the session. Identifies a CM360 creative type.",
      "visible": false
    },
    {
      "name": "sessionCm360CreativeVersion",
      "displayName": "Session CM360 creative version",
      "description": "The CM360 Creative Version that led to the session. The version number helps you keep track of multiple versions of your creative in your reports. If you upload a new asset to an existing creative, the version number is increased by one.",
      "visible": false
    },
    {
      "name": "sessionCm360Medium",
      "displayName": "Session CM360 medium",
      "description": "The CM360 Medium that led to the session. The CM360 medium is also referred to as the placement cost structure.",
      "visible": false
    },
    {
      "name": "sessionCm360PlacementCostStructure",
      "displayName": "Session CM360 placement cost structure",
      "description": "The CM360 Placement Cost Structure that led to the session. Placement cost structures regulate how media cost will be calculated. For example 'CPM'.",
      "visible": false
    },
    {
      "name": "sessionCm360PlacementId",
      "displayName": "Session CM360 placement ID",
      "description": "The CM360 Placement ID that led to the session. Identifies a CM360 placement. A placement is the part of a website where your ad appears.",
      "visible": false
    },
    {
      "name": "sessionCm360PlacementName",
      "displayName": "Session CM360 placement name",
      "description": "The CM360 Placement Name that led to the session. The given name for a CM360 placement. A placement is the part of a website where your ad appears.",
      "visible": false
    },
    {
      "name": "sessionCm360RenderingId",
      "displayName": "Session CM360 rendering ID",
      "description": "The CM360 Rendering ID that led to the session. Identifies a CM360 creative.",
      "visible": false
    },
    {
      "name": "sessionCm360SiteId",
      "displayName": "Session CM360 site ID",
      "description": "The CM360 Site ID that led to the session. Identifies a CM360 site.",
      "visible": false
    },
    {
      "name": "sessionCm360SiteName",
      "displayName": "Session CM360 site name",
      "description": "The CM360 Site Name that led to the session. The CM360 Site name from which the ad space was purchased.",
      "visible": false
    },
    {
      "name": "sessionCm360Source",
      "displayName": "Session CM360 source",
      "description": "The CM360 Source that led to the session. The CM360 source is also referred to as the site name.",
      "visible": false
    },
    {
      "name": "sessionCm360SourceMedium",
      "displayName": "Session CM360 source / medium",
      "description": "The CM360 Source Medium that led to the session. A combination of the source and medium.",
      "visible": false
    },
    {
      "name": "sessionDefaultChannelGroup",
      "displayName": "Session default channel group",
      "description": "The session's default channel group is based primarily on source and medium. An enumeration which includes Direct, Organic Search, Paid Social, Organic Social, Email, Affiliates, Referral, Paid Search, Video, and Display.",
      "visible": false
    },
    {
      "name": "sessionDv360AdvertiserId",
      "displayName": "Session DV360 advertiser ID",
      "description": "The DV360 Advertiser ID that led to the session. Identifies the DV360 advertiser.",
      "visible": false
    },
    {
      "name": "sessionDv360AdvertiserName",
      "displayName": "Session DV360 advertiser name",
      "description": "The DV360 Advertiser Name that led to the session. DV360 advertisers represent real-life businesses that run advertising campaigns.",
      "visible": false
    },
    {
      "name": "sessionDv360CampaignId",
      "displayName": "Session DV360 campaign ID",
      "description": "The DV360 Campaign ID that led to the session. Identifies the DV360 campaign.",
      "visible": false
    },
    {
      "name": "sessionDv360CampaignName",
      "displayName": "Session DV360 campaign name",
      "description": "The DV360 Campaign Name that led to the session. DV360 campaigns group together related insertion orders with a common business goal.",
      "visible": false
    },
    {
      "name": "sessionDv360CreativeFormat",
      "displayName": "Session DV360 creative format",
      "description": "The DV360 Creative Format that led to the session. Also referred to as the creative type. For example, expandable, video, or native.",
      "visible": false
    },
    {
      "name": "sessionDv360CreativeId",
      "displayName": "Session DV360 creative ID",
      "description": "The DV360 Creative ID that led to the session. Identifies the DV360 creative.",
      "visible": false
    },
    {
      "name": "sessionDv360CreativeName",
      "displayName": "Session DV360 creative name",
      "description": "The DV360 Creative Name that led to the session. The name given to a DV360 creative.",
      "visible": false
    },
    {
      "name": "sessionDv360ExchangeId",
      "displayName": "Session DV360 exchange ID",
      "description": "The DV360 Exchange ID that led to the session. Identifies the DV360 exchange.",
      "visible": false
    },
    {
      "name": "sessionDv360ExchangeName",
      "displayName": "Session DV360 exchange name",
      "description": "The DV360 Exchange Name that led to the session. The DV360 ad exchange involved in the ad click. To learn more, see managing exchanges.",
      "visible": false
    },
    {
      "name": "sessionDv360InsertionOrderId",
      "displayName": "Session DV360 insertion order ID",
      "description": "The DV360 Insertion Order ID that led to the session. Identifies the DV360 insertion order.",
      "visible": false
    },
    {
      "name": "sessionDv360InsertionOrderName",
      "displayName": "Session DV360 insertion order name",
      "description": "The DV360 Insertion Order Name that led to the session. A DV360 insertion order contains a set of line items that are related to the same advertising campaign.",
      "visible": false
    },
    {
      "name": "sessionDv360LineItemId",
      "displayName": "Session DV360 line item ID",
      "description": "The DV360 Line Item ID that led to the session. Identifies the DV360 line item.",
      "visible": false
    },
    {
      "name": "sessionDv360LineItemName",
      "displayName": "Session DV360 line item name",
      "description": "The DV360 Line Item Name that led to the session. A DV360 line item bids on impressions and serves creatives to inventory sources.",
      "visible": false
    },
    {
      "name": "sessionDv360Medium",
      "displayName": "Session DV360 medium",
      "description": "The DV360 Medium that led to the session. The billable outcome of the insertion order. For example, cpm.",
      "visible": false
    },
    {
      "name": "sessionDv360PartnerId",
      "displayName": "Session DV360 partner ID",
      "description": "The DV360 Partner ID that led to the session. Identifies the DV360 partner.",
      "visible": false
    },
    {
      "name": "sessionDv360PartnerName",
      "displayName": "Session DV360 partner name",
      "description": "The DV360 Partner Name that led to the session. DV360 partners represent agencies, trading desks, or large individual advertisers.",
      "visible": false
    },
    {
      "name": "sessionDv360Source",
      "displayName": "Session DV360 source",
      "description": "The DV360 Source that led to the session. The DV360 site name where your ad was displayed.",
      "visible": false
    },
    {
      "name": "sessionDv360SourceMedium",
      "displayName": "Session DV360 source / medium",
      "description": "The DV360 Source Medium that led to the session. A combination of the source and medium.",
      "visible": false
    },
    {
      "name": "sessionGoogleAdsAccountName",
      "displayName": "Session Google Ads account name",
      "description": "The Account name from Google Ads that led to the session. Corresponds to customer.descriptive_name in the Google Ads API.",
      "visible": false
    },
    {
      "name": "sessionGoogleAdsAdGroupId",
      "displayName": "Session Google Ads ad group ID",
      "description": "The Ad Group Id in Google Ads for a session.",
      "visible": false
    },
    {
      "name": "sessionGoogleAdsAdGroupName",
      "displayName": "Session Google Ads ad group name",
      "description": "The Ad Group Name in Google Ads for a session.",
      "visible": false
    },
    {
      "name": "sessionGoogleAdsAdNetworkType",
      "displayName": "Session Google Ads ad network type",
      "description": "The advertising network that led to the session. An enumeration which includes Google search, Search partners, Google Display Network, Youtube Search, Youtube Videos, Cross-network, Social, and (universal campaign).",
      "visible": false
    },
    {
      "name": "sessionGoogleAdsCampaignId",
      "displayName": "Session Google Ads campaign ID",
      "description": "The Campaign ID for the Google Ads Campaign that led to this session.",
      "visible": false
    },
    {
      "name": "sessionGoogleAdsCampaignName",
      "displayName": "Session Google Ads campaign",
      "description": "The Campaign name for the Google Ads Campaign that led to this session.",
      "visible": false
    },
    {
      "name": "sessionGoogleAdsCampaignType",
      "displayName": "Session Google Ads campaign type",
      "description": "The campaign type for the Google Ads campaign that led to this session. Campaign types determine where customers see your ads and the settings and options available to you in Google Ads. Campaign type is an enumeration that includes: Search, Display, Shopping, Video, Demand Gen, App, Smart, Hotel, Local, and Performance Max. To learn more, see Choose the right campaign type.",
      "visible": false
    },
    {
      "name": "sessionGoogleAdsCreativeId",
      "displayName": "Session Google Ads creative ID",
      "description": "The ID of the Google Ads creative that led to a session on your website or app. Creative IDs identify individual ads.",
      "visible": false
    },
    {
      "name": "sessionGoogleAdsCustomerId",
      "displayName": "Session Google Ads customer ID",
      "description": "The Customer ID from Google Ads that led to the session. Customer IDs in Google Ads uniquely identify Google Ads accounts.",
      "visible": false
    },
    {
      "name": "sessionGoogleAdsKeyword",
      "displayName": "Session Google Ads keyword text",
      "description": "The matched keyword that led to the session. Keywords are words or phrases describing your product or service that you choose to get your ad in front of the right customers. To learn more about Keywords, see Keywords: Definition.",
      "visible": false
    },
    {
      "name": "sessionGoogleAdsQuery",
      "displayName": "Session Google Ads query",
      "description": "The search query that led to the session.",
      "visible": false
    },
    {
      "name": "sessionManualAdContent",
      "displayName": "Session manual ad content",
      "description": "The ad content that led to a session. Populated by the utm_content parameter.",
      "visible": false
    },
    {
      "name": "sessionManualCampaignId",
      "displayName": "Session manual campaign ID",
      "description": "The manual Campaign ID that led to the session. Identifies the manual campaign. Populated by utm_id URL parameter.",
      "visible": false
    },
    {
      "name": "sessionManualCampaignName",
      "displayName": "Session manual campaign name",
      "description": "The manual Campaign Name that led to the session. The name of the manual campaign. Populated by utm_campaign URL parameter. To learn more, see Collect campaign data with custom URLs.",
      "visible": false
    },
    {
      "name": "sessionManualCreativeFormat",
      "displayName": "Session manual creative format",
      "description": "The manual Creative Format that led to the session. Identifies the creative format used in the ad. Populated by utm_creative_format URL parameter.",
      "visible": false
    },
    {
      "name": "sessionManualMarketingTactic",
      "displayName": "Session manual marketing tactic",
      "description": "The manual Marketing Tactic that led to the session. The targeting criteria applied to a campaign. For example, remarketing or prospecting. Populated by utm_marketing_tactic URL parameter.",
      "visible": false
    },
    {
      "name": "sessionManualMedium",
      "displayName": "Session manual medium",
      "description": "The manual Medium that led to the session. The marketing medium used in the referral. For example, cpc. Populated by utm_medium URL parameter.",
      "visible": false
    },
    {
      "name": "sessionManualSource",
      "displayName": "Session manual source",
      "description": "The manual Source that led to the session. The referrer. Populated by utm_source URL parameter.",
      "visible": false
    },
    {
      "name": "sessionManualSourceMedium",
      "displayName": "Session manual source / medium",
      "description": "The manual Source Medium that led to the session. A combination of the source and medium.",
      "visible": false
    },
    {
      "name": "sessionManualSourcePlatform",
      "displayName": "Session manual source platform",
      "description": "The manual Source Platform that led to the session. The platform responsible for directing traffic to a given Analytics property. Populated by utm_source_platform URL parameter.",
      "visible": false
    },
    {
      "name": "sessionManualTerm",
      "displayName": "Session manual term",
      "description": "The term that led to a session. Populated by the utm_term parameter.",
      "visible": false
    },
    {
      "name": "sessionMedium",
      "displayName": "Session medium",
      "description": "The medium that initiated a session on your website or app.",
      "visible": true
    },
    {
      "name": "sessionPrimaryChannelGroup",
      "displayName": "Session primary channel group",
      "description": "The primary channel group that led to the session. Primary channel groups are the channel groups used in standard reports in Google Analytics and serve as an active record of your property's data in alignment with channel grouping over time. To learn more, see Custom channel groups.",
      "visible": true
    },
    {
      "name": "sessionSa360AdGroupId",
      "displayName": "Session SA360 ad group ID",
      "description": "The SA360 Ad Group ID that led to the session. Identifies the SA360 ad group.",
      "visible": false
    },
    {
      "name": "sessionSa360AdGroupName",
      "displayName": "Session SA360 ad group name",
      "description": "The SA360 Ad Group Name that led to the session. SA360 Ad groups contain ads and keywords that relate to each other.",
      "visible": false
    },
    {
      "name": "sessionSa360CampaignId",
      "displayName": "Session SA360 campaign ID",
      "description": "The SA360 Campaign ID that led to the session. Identifies the SA360 campaign.",
      "visible": false
    },
    {
      "name": "sessionSa360CampaignName",
      "displayName": "Session SA360 campaign",
      "description": "The SA360 Campaign Name that led to the session. A SA360 campaign lets you organize your ads and define a goal for your advertising.",
      "visible": false
    },
    {
      "name": "sessionSa360CreativeFormat",
      "displayName": "Session SA360 creative format",
      "description": "The SA360 Creative Format that led to the session. The creative format is the specific layout or design of the advertisement used in a campaign.",
      "visible": false
    },
    {
      "name": "sessionSa360EngineAccountId",
      "displayName": "Session SA360 engine account ID",
      "description": "The SA360 Engine Account ID that led to the session. Identifies the SA360 engine account.",
      "visible": false
    },
    {
      "name": "sessionSa360EngineAccountName",
      "displayName": "Session SA360 engine account name",
      "description": "The SA360 Engine Account Name that led to the session. A SA360 engine account contains campaigns, ad groups, and other items from an advertising account. To learn more, see SA360 engine account.",
      "visible": false
    },
    {
      "name": "sessionSa360EngineAccountType",
      "displayName": "Session SA360 engine account type",
      "description": "The SA360 Engine Account Type that led to the session. The type of engine used by the search engine account. For example, google ads, bing, or baidu.",
      "visible": false
    },
    {
      "name": "sessionSa360Keyword",
      "displayName": "Session SA360 keyword text",
      "description": "The SA360 Keyword Text that led to the session. The keywords that matched the search query.",
      "visible": false
    },
    {
      "name": "sessionSa360ManagerAccountId",
      "displayName": "Session SA360 manager account ID",
      "description": "The SA360 Manager Account ID that led to the session. Identifies the SA360 manager account.",
      "visible": false
    },
    {
      "name": "sessionSa360ManagerAccountName",
      "displayName": "Session SA360 manager account name",
      "description": "The SA360 Manager Account Name that led to the session. The top level of the Search Ads 360 account hierarchy and is used for administration and reporting across the lower-level sub-manager and client accounts.",
      "visible": false
    },
    {
      "name": "sessionSa360Medium",
      "displayName": "Session SA360 medium",
      "description": "The SA360 Medium that led to the session. The payment mode used in ad buying. For example, cpc.",
      "visible": false
    },
    {
      "name": "sessionSa360Query",
      "displayName": "Session SA360 query",
      "description": "The SA360 Query that led to the session. The search query typed by the user.",
      "visible": false
    },
    {
      "name": "sessionSa360Source",
      "displayName": "Session SA360 source",
      "description": "The SA360 Source that led to the session. The search query happened on this site.",
      "visible": false
    },
    {
      "name": "sessionSa360SourceMedium",
      "displayName": "Session SA360 source / medium",
      "description": "The SA360 Source Medium that led to the session. A combination of the source and medium.",
      "visible": false
    },
    {
      "name": "sessionSource",
      "displayName": "Session source",
      "description": "The source that initiated a session on your website or app.",
      "visible": true
    },
    {
      "name": "sessionSourceMedium",
      "displayName": "Session source / medium",
      "description": "The combined values of the dimensions sessionSource and sessionMedium.",
      "visible": true
    },
    {
      "name": "sessionSourcePlatform",
      "displayName": "Session source platform",
      "description": "The source platform of the session's campaign. Don't depend on this field returning Manual for traffic that uses UTMs; this field will update from returning Manual to returning (not set) for an upcoming feature launch.",
      "visible": true
    },
    {
      "name": "shippingTier",
      "displayName": "Shipping tier",
      "description": "The shipping tier selected for delivery of the purchased item. For example, Ground, Air, or Next-day. Populated by the shipping_tier event parameter.",
      "visible": false
    },
    {
      "name": "signedInWithUserId",
      "displayName": "Signed in with user ID",
      "description": "The string yes if the user signed in with the User-ID feature. To learn more about User-ID, see Measure activity across platforms with User-ID.",
      "visible": false
    },
    {
      "name": "source",
      "displayName": "Source",
      "description": "The source attributed to the key event.",
      "visible": true
    },
    {
      "name": "sourceMedium",
      "displayName": "Source / medium",
      "description": "The combined values of the dimensions source and medium.",
      "visible": true
    },
    {
      "name": "sourcePlatform",
      "displayName": "Source platform",
      "description": "The source platform of the key event's campaign. Don't depend on this field returning Manual for traffic that uses UTMs; this field will update from returning Manual to returning (not set) for an upcoming feature launch.",
      "visible": true
    },
    {
      "name": "streamId",
      "displayName": "Stream ID",
      "description": "The numeric data stream identifier for your app or website.",
      "visible": false
    },
    {
      "name": "streamName",
      "displayName": "Stream name",
      "description": "The data stream name for your app or website.",
      "visible": true
    },
    {
      "name": "testDataFilterId",
      "displayName": "Test data filter ID",
      "description": "The numeric identifier of a data filter in testing state. You use data filters to include or exclude event data from your reports based on event-parameter values. To learn more, see Data filters.",
      "visible": false
    },
    {
      "name": "testDataFilterName",
      "displayName": "Test data filter name",
      "description": "The name of data filters in testing state. You use data filters to include or exclude event data from your reports based on event-parameter values. To learn more, see Data filters.",
      "visible": false
    },
    {
      "name": "transactionId",
      "displayName": "Transaction ID",
      "description": "The ID of the ecommerce transaction.",
      "visible": false
    },
    {
      "name": "unifiedPagePathScreen",
      "displayName": "Page path and screen class",
      "description": "The page path (web) or screen class (app) on which the event was logged.",
      "visible": false
    },
    {
      "name": "unifiedPageScreen",
      "displayName": "Page path + query string and screen class",
      "description": "The page path and query string (web) or screen class (app) on which the event was logged.",
      "visible": false
    },
    {
      "name": "unifiedScreenClass",
      "displayName": "Page title and screen class",
      "description": "The page title (web) or screen class (app) on which the event was logged.",
      "visible": false
    },
    {
      "name": "unifiedScreenName",
      "displayName": "Page title and screen name",
      "description": "The page title (web) or screen name (app) on which the event was logged.",
      "visible": false
    },
    {
      "name": "userAgeBracket",
      "displayName": "Age",
      "description": "User age brackets.",
      "visible": true
    },
    {
      "name": "userGender",
      "displayName": "Gender",
      "description": "User gender.",
      "visible": true
    },
    {
      "name": "videoProvider",
      "displayName": "Video provider",
      "description": "The source of the video (for example, youtube). Automatically populated for embedded videos if Enhanced Measurement is enabled. Populated by the event parameter video_provider.",
      "visible": true
    },
    {
      "name": "videoTitle",
      "displayName": "Video title",
      "description": "The title of the video. Automatically populated for embedded videos if Enhanced Measurement is enabled. Populated by the event parameter video_title.",
      "visible": true
    },
    {
      "name": "videoUrl",
      "displayName": "Video URL",
      "description": "The URL of the video. Automatically populated for embedded videos if Enhanced Measurement is enabled. Populated by the event parameter video_url.",
      "visible": true
    },
    {
      "name": "virtualCurrencyName",
      "displayName": "Virtual currency name",
      "description": "The name of a virtual currency with which the user is interacting. Such as spending or purchasing gems in a game. Populated by the virtual_currency_name event parameter.",
      "visible": false
    },
    {
      "name": "visible",
      "displayName": "Visible",
      "description": "Returns true if the content is visible. Automatically populated for embedded videos if Enhanced Measurement is enabled. Populated by the event parameter visible.",
      "visible": false
    },
    {
      "name": "week",
      "displayName": "Week",
      "description": "The week of the event, a two-digit number from 01 to 53. Each week starts on Sunday. January 1st is always in week 01. The first and last week of the year have fewer than 7 days in most years. Weeks other than the first and the last week of the year always have 7 days. For years where January 1st is a Sunday, the first week of that year and the last week of the prior year have 7 days.",
      "visible": true
    },
    {
      "name": "year",
      "displayName": "Year",
      "description": "The four-digit year of the event. For example, 2020 or 2024.",
      "visible": true,
      "dataType": {
        "type": "date",
        "dateFormat": "yyyy"
      }
    },
    {
      "name": "yearMonth",
      "displayName": "Year month",
      "description": "The combined values of year and month. Example values include 202212 or 202301.",
      "visible": true,
      "dataType": {
        "type": "date",
        "dateFormat": "yyyyMM"
      }
    },
    {
      "name": "yearWeek",
      "displayName": "Year week",
      "description": "The combined values of year and week. Example values include 202253 or 202301.",
      "visible": true
    }
  ]
}
